#---------------------------------------------------------------------
# start session at Sun Dec 4 17:09:14 2022
# Exec path is /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/arch/linux/x86_64/2.12/64/bin
#---------------------------------------------------------------------
--------------------------------------------------------------------------------
|    Nitro-SoC version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019    | 
| Running on localhost.localdomain 1core 3.9GBytes 2.6GHz 64bits mode pid 6211 | 
|             Copyright (c) 2003-2019 Mentor Graphics Corporation              | 
|                             All Rights Reserved                              | 
|         THIS WORK CONTAINS TRADE SECRET AND PROPRIETARY INFORMATION          | 
|             WHICH IS THE PROPERTY OF MENTOR GRAPHICS CORPORATION             | 
|              OR ITS LICENSORS AND IS SUBJECT TO LICENSE TERMS.               | 
--------------------------------------------------------------------------------

Nitro-SoC> start 
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/root.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/Design -cpus 4
error UI19: Cannot open file '/home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/Design/init_db.tcl'.
error UI3: Specify a valid file list value for '-files' .
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/root.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/place.db/root.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/place.db/root.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> zoom_to -target area -xl_area -11680a -yb_area -4541a -xr_area 57069a -yt_area 64208a
Nitro-SoC> zoom_to -target area -xl_area -42280a -yb_area -11346a -xr_area 72300a -yt_area 103234a
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/place.db/root.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/place.db/root.db 
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/place.db/root.db -cpus 1
error used wrong file format
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
error UI1339: Missing directory '/home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db/Technology'.
error UI26: Script file '/home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db/init_db.tcl' execution failed (and stopped) at line 1 (load_db /home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db).
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/export.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
error UI1339: Missing directory '/home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/Technology'.
error UI26: Script file '/home/vlsi/Desktop/Lab5_2022/work/dbs/export.db/init_db.tcl' execution failed (and stopped) at line 1 (load_db /home/vlsi/Desktop/Lab5_2022/work/dbs/export.db).
info UI155: Nitro-SoC terminated with exit status of 3 (abort).
#---------------------------------------------------------------------
# end session at Sun Dec 4 17:19:29 2022
#---------------------------------------------------------------------
#---------------------------------------------------------------------
# start session at Sun Dec 4 17:19:35 2022
# Exec path is /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/arch/linux/x86_64/2.12/64/bin
#---------------------------------------------------------------------
--------------------------------------------------------------------------------
|    Nitro-SoC version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019    | 
| Running on localhost.localdomain 1core 3.9GBytes 2.6GHz 64bits mode pid 6838 | 
|             Copyright (c) 2003-2019 Mentor Graphics Corporation              | 
|                             All Rights Reserved                              | 
|         THIS WORK CONTAINS TRADE SECRET AND PROPRIETARY INFORMATION          | 
|             WHICH IS THE PROPERTY OF MENTOR GRAPHICS CORPORATION             | 
|              OR ITS LICENSORS AND IS SUBJECT TO LICENSE TERMS.               | 
--------------------------------------------------------------------------------

Nitro-SoC> start
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/floorplan.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
error UI1339: Missing directory '/home/vlsi/Desktop/Lab5_2022/work/dbs/floorplan.db/Technology'.
error UI26: Script file '/home/vlsi/Desktop/Lab5_2022/work/dbs/floorplan.db/init_db.tcl' execution failed (and stopped) at line 1 (load_db /home/vlsi/Desktop/Lab5_2022/work/dbs/floorplan.db).
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/import.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
error UI1339: Missing directory '/home/vlsi/Desktop/Lab5_2022/work/dbs/import.db/Technology'.
error UI26: Script file '/home/vlsi/Desktop/Lab5_2022/work/dbs/import.db/init_db.tcl' execution failed (and stopped) at line 1 (load_db /home/vlsi/Desktop/Lab5_2022/work/dbs/import.db).
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/libs.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
info UI1340: Loading folded database from '/home/vlsi/Desktop/Lab5_2022/work/dbs/libs.db'.
Database information: 
----------------------------------------------------------------------------------
| Property Name | Property Value                                 | Property Type | 
|---------------+------------------------------------------------+---------------|
| name*         |                                                | string        | 
|---------------+------------------------------------------------+---------------|
| file          | /home/vlsi/Desktop/Lab5_2022/work/dbs/libs.db/ | string        | 
|---------------+------------------------------------------------+---------------|
| host          | Linux (localhost.localdomain)                  | string        | 
|---------------+------------------------------------------------+---------------|
| build         | 1.68700.2.290                                  | string        | 
|---------------+------------------------------------------------+---------------|
| date          | Sun Dec 4 16:46:09 2022                        | string        | 
|---------------+------------------------------------------------+---------------|
| p_version     | 2019.1.R2                                      | string        | 
|---------------+------------------------------------------------+---------------|
| comment*      |                                                | string        | 
|---------------+------------------------------------------------+---------------|
| db_version    | 4.0.5                                          | string        | 
|---------------+------------------------------------------------+---------------|
| is_current    | true                                           | bool          | 
----------------------------------------------------------------------------------

info UI33: performed database load for 0 sec (CPU time: 0 sec; MEM: RSS - 164M, CVMEM - 762M, PVMEM - 784M)
info UI1340: Loading libraries from '/home/vlsi/Desktop/Lab5_2022/work/dbs/libs.db/Technology/'.
info UI33: performed library load for 0 sec (CPU time: 0 sec; MEM: RSS - 167M, CVMEM - 772M, PVMEM - 784M)
info UI33: performed source of /home/vlsi/Desktop/Lab5_2022/work/dbs/libs.db/init_db.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 167M, CVMEM - 772M, PVMEM - 784M)
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
info UI1340: Loading folded database from '/home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db'.
Database information: 
-----------------------------------------------------------------------------------
| Property Name | Property Value                                  | Property Type | 
|---------------+-------------------------------------------------+---------------|
| name*         |                                                 | string        | 
|---------------+-------------------------------------------------+---------------|
| file          | /home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db/ | string        | 
|---------------+-------------------------------------------------+---------------|
| host          | Linux (localhost.localdomain)                   | string        | 
|---------------+-------------------------------------------------+---------------|
| build         | 1.68700.2.290                                   | string        | 
|---------------+-------------------------------------------------+---------------|
| date          | Sun Dec 4 16:49:08 2022                         | string        | 
|---------------+-------------------------------------------------+---------------|
| p_version     | 2019.1.R2                                       | string        | 
|---------------+-------------------------------------------------+---------------|
| comment*      |                                                 | string        | 
|---------------+-------------------------------------------------+---------------|
| db_version    | 4.0.5                                           | string        | 
|---------------+-------------------------------------------------+---------------|
| is_current    | true                                            | bool          | 
-----------------------------------------------------------------------------------

info UI33: performed database load for 0 sec (CPU time: 0 sec; MEM: RSS - 167M, CVMEM - 772M, PVMEM - 802M)
info UI1340: Loading design from '/home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db/Design'.
info Reading Scan data
info Reading Trailing data
Successfully mapped 0 checks
info UI33: performed design load for 0 sec (CPU time: 0 sec; MEM: RSS - 176M, CVMEM - 784M, PVMEM - 874M)
info UI33: performed source of /home/vlsi/Desktop/Lab5_2022/work/dbs/clock.db/init_db.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 176M, CVMEM - 784M, PVMEM - 874M)
Nitro-SoC> source flow_scripts/3_route.tcl > LOGs/route.log

info UI54: redirecting output of source to LOGs/route.log
info UI54: redirecting output of report_route_nets to /dev/null
info UI54: redirecting output of check_lvs -nets $tdro::env::data_nets -name gr_lvs -global -quiet to /dev/null
info UI54: redirecting output of report_route_nets to /dev/null
info UI54: redirecting output of report_route_nets to /dev/null
info UI54: redirecting output of 
            report_mcmm_variation 
            if { [llength [get_corners -filter "@setup==true && @enable==true"]] } {
                report_path_group -violators_only -sort wns
                report_slack_histogram -num_critical_bins 50 
            } 
            if { [llength [get_corners -filter "@hold==true && @enable==true"]] } {
                report_path_group -violators_only -sort wns -min
                report_slack_histogram -min  -num_critical_bins 50 
            }
 to reports/route_timing_summary.rpt
Report 'report_mcmm_variation': MCMM Variation
Generated on Sun Dec 4 17:23:20 2022
  
---------------------------------------------------------------
| MCMM variability report for design 'integrationMult' (nano) |
|-------------------------------------------------------------|
| MODE CORNER WNS TNS #Endpts WHS THS #Endpts                 | 
---------------------------------------------------------------

info UI33: performed report_mcmm_variation for 0 sec (CPU time: 0 sec; MEM: RSS - 262M, CVMEM - 872M, PVMEM - 902M)
Report 'report_path_group': Path Group
Generated on Sun Dec 4 17:23:20 2022
  
-------------------------------------------------------------------------------------------
|                               PATH GROUPS (SETUP) (nano)                                |
|-----------------------------------------------------------------------------------------|
| QOR Weight Margin TNS Range Endpoints Violating Endpoints Violating Endpoints % WNS TNS | 
-------------------------------------------------------------------------------------------

info UI33: performed report_path_group for 0 sec (CPU time: 0 sec; MEM: RSS - 262M, CVMEM - 872M, PVMEM - 902M)
SLACK HISTOGRAM
---------------
Select : SELECT_LATE

---------------------------------------------
| Slack           # End Pts Total # End Pts | 
|-------------------------------------------|
| 0.0000 - 0.7490 35        35              | 
| 0.7500 - 1.4990 17        52              | 
---------------------------------------------

info UI33: performed report_slack_histogram for 0 sec (CPU time: 0 sec; MEM: RSS - 262M, CVMEM - 872M, PVMEM - 902M)
Report 'report_path_group': Path Group
Generated on Sun Dec 4 17:23:20 2022
  
-------------------------------------------------------------------------------------------
|                                PATH GROUPS (HOLD) (nano)                                |
|-----------------------------------------------------------------------------------------|
| QOR Weight Margin TNS Range Endpoints Violating Endpoints Violating Endpoints % WNS TNS | 
-------------------------------------------------------------------------------------------

info UI33: performed report_path_group for 0 sec (CPU time: 0 sec; MEM: RSS - 262M, CVMEM - 872M, PVMEM - 902M)
SLACK HISTOGRAM
---------------
Select : SELECT_EARLY

---------------------------------------------
| Slack           # End Pts Total # End Pts | 
|-------------------------------------------|
| 0.0000 - 0.2490 27        27              | 
| 0.2500 - 0.4990 25        52              | 
---------------------------------------------

info UI33: performed report_slack_histogram for 0 sec (CPU time: 0 sec; MEM: RSS - 262M, CVMEM - 872M, PVMEM - 902M)
info UI54: redirecting output of 
           if { [llength [get_corners -filter "@setup==true && @enable==true"]] } {
                report_timing -max_paths $num_max_path
           } 
 to reports/route_max_timing_paths.rpt
info UI54: redirecting output of 
           if { [llength [get_corners -filter "@hold==true && @enable==true"]] } {
               report_timing -max_paths $num_max_path -min 
           } 
 to reports/route_min_timing_paths.rpt
info UI54: redirecting output of 
           report_constraint -max_tran -all_violators -verbose
 to reports/route_timing_drc.rpt
info UI54: redirecting output of 
           check_lvs -open_distribution
           check_drc  
           check_placement
           report_region_utilization
 to reports/route_physical.rpt
info UI54: redirecting output of 
               report_power_summary
               report_analysis_corner
 to reports/route_power.rpt
Report 'report_power_summary': Power
Generated on Sun Dec 4 17:23:20 2022
  
--------------------------------------------------------------------------
|                        Power Summary (nanowatt)                        |
|------------------------------------------------------------------------|
| Component          Internal Switching  Dynamic Leakage  Total  Percent | 
|------------------------------------------------------------------------|
| Entire design        554066    381503   935569   13743  949311  100.00 | 
|                                                                        | 
| Power of all cells   554066    300039   854104   13743  867847   91.42 | 
|   Clock cells         66019      8771    74790     228   75019    7.90 | 
|   Data cells         488046    291268   779314   13514  792829   83.52 | 
|     Combinational    224697    261405   486102   11017  497119   52.37 | 
|     Registers        263242     29863   293105    2497  295602   31.14 | 
|     Macros                0         0        0       0       0    0.00 | 
|     Physical              0         0        0       0       0    0.00 | 
|                                                                        | 
| Power of all nets               81464    81464           81464    8.58 | 
|   Clock nets                    16831    16831           16831    1.77 | 
|     Clock leaves                10413    10413           10413    1.10 | 
|   Data nets                     64633    64633           64633    6.81 | 
--------------------------------------------------------------------------

info UI33: performed report_power_summary for 0 sec (CPU time: 0 sec; MEM: RSS - 263M, CVMEM - 872M, PVMEM - 902M)
------------------------------------------------------------------------------------------------------------------------------------------------
| Corner     Enable Setup Hold  CRPR       SI    Power            EM   Voltage Drop DRC        Process                    RC Temp Scale Factor | 
|----------------------------------------------------------------------------------------------------------------------------------------------|
| slow       false  true  false setup_hold none  leakage          none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
| fast       false  false false setup_hold none  leakage          none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
| corner_0_0 true   true  true  setup_hold delay leakage, dynamic none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
------------------------------------------------------------------------------------------------------------------------------------------------

Nitro-SoC> check_design 
info CHK10: Checking technology...
info CHK10: Checking libraries...
info CHK10: Checking design...
info CHK10: Checking partition...
info CHK10: Checking cells...
info CHK10: Checking nets...
info CHK10: Checking pins...
info CHK10: Checking placement...
info Found 471 movable and 36 fixed cells in partition integrationMult
info DP136: Found 0 moveable cells and 0 fixed cells to be illegal.
info CHK10: Checking floorplan...
------------------------------------------------------------------------------------------------------------
|                                            Technology Errors                                             |
|----------------------+-------+---------+-----------------------------------------------------------------|
| Name                 | Count | Status  | Description                                                     | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| no_parasitics        | 0     | Passed  | Layer has no corresponding parasitics data                      | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| no_ndr_vias          | 0     | Passed  | No vias at all in non default rule.                             | 
|                      |       |         | Use default vias                                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| partial_ndr_vias     | 1     | Warning | Not all layers have vias in non default rule.                   | 
|                      |       |         | Use default vias                                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| duplicate_lvias      | 0     | Passed  | Duplicate name for some lib_vias in non default rule.           | 
|                      |       |         | To avoid unpredictable results please fix the problem by        | 
|                      |       |         | keeping unique names.                                           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_width      | 0     | Passed  | Nondefault rule width is less then default width on the         | 
|                      |       |         | layer                                                           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_space      | 0     | Passed  | Nondefault rule spacing is less then required spacing on        | 
|                      |       |         | the layer                                                       | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_min_layer  | 0     | Passed  | Nondefault rule min layer is higher than partition max layer    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_max_layer  | 0     | Passed  | Nondefault rule max layer is higher than partition max layer    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| ndr_duplicated       | 0     | Passed  | Nondefault rule has duplication in different libraries          | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_min_area       | 0     | Passed  | Min area requirement is too big                                 | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_hole_area      | 0     | Passed  | Hole area requirement is too big                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_mfgrid         | 0     | Passed  | Manufacturing grid is too big                                   | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| not_even_mfgrid      | 0     | Passed  | All width and spacing rules on all metal and cut layers must be | 
|                      |       |         | an even multiple of manufacturing grid (2*N*mg)                 | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_layer_dir      | 0     | Passed  | Direction of the layer is not reversed to below layer           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_layer_order    | 0     | Passed  | Order of layer is wrong, should be metal-cut-metal-...-metal    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_m1_width       | 0     | Passed  | Width of M1 pins is less then minimum width parameter           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_cut_size       | 0     | Passed  | Size of cut is not defined and can't be determined              | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_cut_space      | 0     | Passed  | Space between cuts is not defined and can't be determined       | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_diff_cut_space | 0     | Passed  | Diffnet cut spacing is less then samenet cut spacing            | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_proj_cut_space | 0     | Passed  | Projection cut spacing is less to diffnet cut spacing           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| max_metal            | 0     | Passed  | Top metal is too wide for routing                               | 
------------------------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
|                                       Pin Errors                                        |
|----------------------+-------+---------+------------------------------------------------|
| Name                 | Count | Status  | Description                                    | 
|----------------------+-------+---------+------------------------------------------------|
| not_connected        | 32    | Warning | Pin is not connected to any net                | 
|----------------------+-------+---------+------------------------------------------------|
| pg_not_connected     | 0     | Passed  | PG core pin is not connected to any supply net | 
|----------------------+-------+---------+------------------------------------------------|
| no_leaf_pin_geometry | 4     | Warning | Leaf pin doesn't have geometry or not placed.  | 
-------------------------------------------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------
|                                               Floorplan Errors                                                |
|---------------------------+-------+---------+-----------------------------------------------------------------|
| Name                      | Count | Status  | Description                                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_tracks                 | 0     | Passed  | No preferred direction routing tracks on the layer.             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| track_step_too_small      | 0     | Passed  | Step of routing tracks is smaller then via-wire spacing.        | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| track_step_too_big        | 0     | Passed  | Step of routing tracks is bigger then via-wire spacing.         | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| diff_track_step           | 0     | Passed  | Different step of preferred direction routing tracks.           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_not_cover_pin      | 0     | Passed  | Routing tracks do not cover pin.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_not_masked         | 0     | Passed  | Routing tracks shall have mask on masked layer.                 | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_incorrectly_masked | 0     | Passed  | Routing tracks masks shall interlace.                           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_macro_pin_access       | 0     | Passed  | Macro pin doesn't have routing access.                          | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| macro_pin_blocked         | 0     | Passed  | Macro pin may be blocked by nearby objects.                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_port_access            | 0     | Passed  | Partition port doesn't have routing access.                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| not_aligned_pin           | 0     | Passed  | Macro/top pin is not aligned to manufacturing grid.             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| offgrid_core_access       | 0     | Passed  | Library core pin has only offgird routing access.               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_core_access            | 0     | Passed  | Library core pin doesn't have routing access.                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_port_geometry          | 0     | Passed  | Port doesn't have geometry or not placed.                       | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_outside_partition    | 0     | Passed  | Port is placed outside partition.                               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_min_area             | 0     | Passed  | Port has insufficient minimum area.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_short                | 0     | Passed  | Port has intersection with other one.                           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_spacing              | 0     | Passed  | Port has insufficient spacing with other one.                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_above_max_layer      | 0     | Passed  | Port is above of max layer.                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_overlaps           | 0     | Passed  | Region overlaps other region.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| cell_outside_region       | 0     | Passed  | Cell outside of region with member_hard requirement. Will       | 
|                           |       |         | cause pin assignment to fail.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| cell_inside_region        | 0     | Passed  | Foreign cell is inside region with non_member_hard requirement. | 
|                           |       |         | Will cause pin assignment to fail                               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_off_mfg_grid       | 0     | Passed  | Region is not on manufacturing grid                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_off_fp_grid        | 0     | Passed  | Region is not on floorplan grid.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| excessive_region_blockage | 0     | Passed  | Placement blockages cover more than 70% of region. Run          | 
|                           |       |         | report_region_utilization to verify placeability.               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| macro_off_mfg             | 0     | Passed  | Macro off manufacturing grid.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| missing_cell_rows         | 0     | Passed  | No cell rows are found in the design. Placer will fail          | 
|                           |       |         | without rows.                                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| partition_overlap         | 0     | Passed  | Partition overlaps other partition.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| partition_off_fp_grid     | 0     | Passed  | Partition is not on floorplan grid.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| endcap_alignment          | 0     | Passed  | Cell is not aligned with the cell row.                          | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| row_without_endcaps       | 46    | Warning | Row has no endcap cells at ends.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_pin_mask               | 0     | Passed  | Port shape does not have a mask on a masked layer.              | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| narrow_pin_misalignment   | 0     | Passed  | Narrow port shape mask, on masked layer, doesn't match          | 
|                           |       |         | track mask.                                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| wide_pin_misalignment     | 0     | Passed  | Wide port shape mask, on masked layer, should be on alternate   | 
|                           |       |         | mask to reduce routing congestion.                              | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| short_placement_width     | 0     | Passed  | The width of the placement rectangle is short.                  | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| object_off_floorplan_grid | 0     | Passed  | Objects are off floorplan grid.                                 | 
-----------------------------------------------------------------------------------------------------------------

info UI33: performed design checks for 0 sec (CPU time: 0 sec; MEM: RSS - 264M, CVMEM - 872M, PVMEM - 902M)
Nitro-SoC> report_timing -max_delay

 Timing Path to outB/out_reg[6]/D 
  
 Path Start Point : regB/out_reg[4] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Path End Point   : outB/out_reg[6] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Mode             : new_mode 
 Corner           : corner_0_0 
 Data Cell Derate : 1 
 Data Net Derate  : 1 
 Clock Cell Derate: Early = 1 / Late = 1 
 Clock Net Derate : Early = 1 / Late = 1 
 Path Type        : max 
 Path Group       : sysclk_new_mode 
 CRPR Threshold   : 5 
  
 Attributes  : U - cell is dont use 
             : M - cell is dont modify 
             : m - net is dont modify 
             : n - connected (sub)net is dont modify 
             : S - cell is size only 
             : F - cell is fixed 
             : C - cell has annotated timing constraints 
             : c - pin has annotated timing constraints 
             : A - cell is affected by case analysis 
             : L - Estimated latency 
             : O - CTS offset 
  
 Opt Attr    : I - is ideal 
             : L - is internal logic const 
             : K - is in clock network 
             : M - has only don't modify nets 
             : N - has no load pin 
             : D - has zero or multiple drivers 
             : G - is valid global net 
             : T - is not switching 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
| Pin                          | Cell          | Edge | Arrival | Delay  | Slew   | DeltaDelay  | Wire Cap  | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    clk                       |               | Rise |  0.0000 | 0.0000 | 0.1000 |             | 5.30468   | 7.2488   | 12.5535   |         | 4       | 57.221   | c    | K        | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk                  |               | Rise |  0.0000 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk_gate_out_reg/CK  | CLKGATETST_X1 | Rise |  0.0000 | 0.0000 | 0.1000 |             |           | 1.8122   |           |         |         |          | FA   |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk_gate_out_reg/GCK | CLKGATETST_X1 | Rise |  0.0660 | 0.0660 | 0.0290 |             | 3.41242   | 7.59723  | 11.0096   |         | 8       | 57.221   | FA   | K        | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
| Data Path:                   |               |      |         |        |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/out_reg[4]/CK        | DFF_X1        | Rise |  0.0660 | 0.0000 | 0.0290 |             |           | 0.949653 |           |         |         |          | F    |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/out_reg[4]/Q         | DFF_X1        | Rise |  0.2100 | 0.1440 | 0.0560 |             | 5.372     | 17.8586  | 23.2306   |         | 12      | 54.0402  | F    |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/out[4]               |               | Rise |  0.2100 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/inputB[4]            |               | Rise |  0.2100 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/inputB[4]        |               | Rise |  0.2100 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_88/A           | INV_X1        | Rise |  0.2110 | 0.0010 | 0.0560 |             |           | 1.70023  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_88/ZN          | INV_X1        | Fall |  0.2360 | 0.0250 | 0.0190 |             | 2.36811   | 4.89599  | 7.2641    |         | 3       | 57.221   |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_242/B1         | OAI21_X1      | Fall |  0.2370 | 0.0010 | 0.0190 |    0.0010   |           | 1.45983  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_242/ZN         | OAI21_X1      | Rise |  0.2900 | 0.0530 | 0.0380 |             | 1.07563   | 4.93752  | 6.01315   |         | 3       | 54.0402  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_241/A          | INV_X1        | Rise |  0.2900 | 0.0000 | 0.0380 |             |           | 1.70023  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_241/ZN         | INV_X1        | Fall |  0.3000 | 0.0100 | 0.0100 |             | 0.196939  | 1.62635  | 1.82329   |         | 1       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_238/A          | AOI21_X1      | Fall |  0.3000 | 0.0000 | 0.0100 |             |           | 1.53534  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_238/ZN         | AOI21_X1      | Rise |  0.3610 | 0.0610 | 0.0410 |             | 0.906839  | 4.9924   | 5.89924   |         | 3       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_236/A2         | NOR2_X1       | Rise |  0.3610 | 0.0000 | 0.0410 |             |           | 1.65135  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_236/ZN         | NOR2_X1       | Fall |  0.3810 | 0.0200 | 0.0140 |             | 0.415007  | 3.2527   | 3.66771   |         | 2       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_286/A          | AOI21_X1      | Fall |  0.3810 | 0.0000 | 0.0140 |             |           | 1.53534  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_286/ZN         | AOI21_X1      | Rise |  0.4400 | 0.0590 | 0.0380 |             | 0.861159  | 4.30637  | 5.16753   |         | 3       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_283/A2         | OR2_X1        | Rise |  0.4400 | 0.0000 | 0.0380 |             |           | 0.941939 |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_283/ZN         | OR2_X1        | Rise |  0.4790 | 0.0390 | 0.0120 |             | 0.543028  | 3.34105  | 3.88408   |         | 2       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_282/A2         | NAND2_X1      | Rise |  0.4790 | 0.0000 | 0.0120 |             |           | 1.6642   |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_282/ZN         | NAND2_X1      | Fall |  0.5000 | 0.0210 | 0.0120 |             | 0.723338  | 3.81376  | 4.5371    |         | 2       | 58.6272  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_312/B1         | AOI221_X1     | Fall |  0.5000 | 0.0000 | 0.0120 |             |           | 1.57405  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_312/ZN         | AOI221_X1     | Rise |  0.5870 | 0.0870 | 0.0560 |             | 0.312982  | 3.36228  | 3.67526   |         | 2       | 58.0804  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_311/A          | INV_X1        | Rise |  0.5870 | 0.0000 | 0.0560 |             |           | 1.70023  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_311/ZN         | INV_X1        | Fall |  0.6030 | 0.0160 | 0.0150 |             | 0.522217  | 3.18932  | 3.71154   |         | 2       | 58.0804  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_341/A1         | NAND2_X1      | Fall |  0.6030 | 0.0000 | 0.0150 |             |           | 1.5292   |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_341/ZN         | NAND2_X1      | Rise |  0.6210 | 0.0180 | 0.0100 |             | 0.215094  | 1.6642   | 1.87929   |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_340/A2         | NAND2_X1      | Rise |  0.6210 | 0.0000 | 0.0100 |             |           | 1.6642   |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_340/ZN         | NAND2_X1      | Fall |  0.6410 | 0.0200 | 0.0180 |             | 0.645436  | 4.12747  | 4.7729    |         | 3       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_318/A1         | OR2_X1        | Fall |  0.6410 | 0.0000 | 0.0180 |             |           | 0.792385 |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_318/ZN         | OR2_X1        | Fall |  0.7030 | 0.0620 | 0.0160 |             | 0.941469  | 7.49661  | 8.43808   |         | 5       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_374/A1         | AND3_X1       | Fall |  0.7030 | 0.0000 | 0.0160 |             |           | 0.86614  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_374/ZN         | AND3_X1       | Fall |  0.7380 | 0.0350 | 0.0070 |             | 0.600981  | 1.63225  | 2.23323   |         | 1       | 56.5944  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_376/C1         | AOI221_X1     | Fall |  0.7380 | 0.0000 | 0.0070 |             |           | 1.38349  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_376/ZN         | AOI221_X1     | Rise |  0.7860 | 0.0480 | 0.0440 |             | 0.369523  | 1.647    | 2.01653   |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_378/B1         | AOI21_X1      | Rise |  0.7860 | 0.0000 | 0.0440 |             |           | 1.647    |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_378/ZN         | AOI21_X1      | Fall |  0.8130 | 0.0270 | 0.0180 |             | 0.3907    | 3.27212  | 3.66282   |         | 2       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_379/A          | INV_X1        | Fall |  0.8130 | 0.0000 | 0.0180 |             |           | 1.54936  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_379/ZN         | INV_X1        | Rise |  0.8360 | 0.0230 | 0.0130 |             | 0.692135  | 3.24604  | 3.93817   |         | 2       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_409/B1         | AOI21_X1      | Rise |  0.8360 | 0.0000 | 0.0130 |             |           | 1.647    |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_409/ZN         | AOI21_X1      | Fall |  0.8550 | 0.0190 | 0.0120 |             | 0.366909  | 3.23394  | 3.60085   |         | 2       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_407/B2         | OAI21_X1      | Fall |  0.8550 | 0.0000 | 0.0120 |             |           | 1.55833  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_407/ZN         | OAI21_X1      | Rise |  0.8890 | 0.0340 | 0.0200 |             | 0.319413  | 1.67072  | 1.99013   |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_404/A          | OAI21_X1      | Rise |  0.8890 | 0.0000 | 0.0200 |             |           | 1.67072  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_404/ZN         | OAI21_X1      | Fall |  0.9110 | 0.0220 | 0.0100 |             | 0.297558  | 1.70023  | 1.99779   |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_403/A          | INV_X1        | Fall |  0.9110 | 0.0000 | 0.0100 |             |           | 1.54936  |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/i_403/ZN         | INV_X1        | Rise |  0.9220 | 0.0110 | 0.0060 |             | 0.0073601 | 0.918145 | 0.925505  |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/i_0/result[14]       |               | Rise |  0.9220 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    mult/result[14]           |               | Rise |  0.9220 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/inp[6]               |               | Rise |  0.9220 | 0.0000 |        |             |           |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/i_0_8/A1             | AND2_X1       | Rise |  0.9220 | 0.0000 | 0.0060 |             |           | 0.918145 |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/i_0_8/ZN             | AND2_X1       | Rise |  0.9500 | 0.0280 | 0.0080 |             | 0.224212  | 1.14029  | 1.3645    |         | 1       | 52.7934  |      |          | 
|------------------------------+---------------+------+---------+--------+--------+-------------+-----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/out_reg[6]/D         | DFF_X1        | Rise |  0.9500 | 0.0000 | 0.0080 |             |           | 1.14029  |           |         |         |          | F    |          | 
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

 Required Time Trace to outB/out_reg[6]/CK 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------
| Pin                          | Cell          | Edge | Arrival | Delay  | Slew   | Wire Cap | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    clk                       |               | Rise |  0.0000 | 0.0000 | 0.1000 | 5.30468  | 6.67034  | 11.975    |         | 4       | 57.221   | c    | K        | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/clk                  |               | Rise |  0.0000 | 0.0000 |        |          |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/clk_gate_out_reg/CK  | CLKGATETST_X1 | Rise |  0.0010 | 0.0010 | 0.1000 |          | 1.8122   |           |         |         |          | FA   |          | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/clk_gate_out_reg/GCK | CLKGATETST_X1 | Rise |  0.0630 | 0.0620 | 0.0250 | 2.48515  | 6.85152  | 9.33667   |         | 8       | 52.7934  | FA   | K        | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    outB/out_reg[6]/CK        | DFF_X1        | Rise |  0.0630 | 0.0000 | 0.0250 |          | 0.949653 |           |         |         |          | F    |          | 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

---------------------------------------------------------------
|                                          | Time    | Total  | 
|------------------------------------------+---------+--------|
| target clock sysclk_new_mode (rise edge) |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock cycle shift                 |  1.0000 | 1.0000 | 
|------------------------------------------+---------+--------|
| target clock propagated network latency  |  0.0630 | 1.0630 | 
|------------------------------------------+---------+--------|
| library setup check                      | -0.0280 | 1.0350 | 
|------------------------------------------+---------+--------|
| data required time                       |  1.0350 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| data required time                       |  1.0350 |        | 
|------------------------------------------+---------+--------|
| data arrival time                        | -0.9500 |        | 
|------------------------------------------+---------+--------|
| pessimism                                |  0.0000 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| slack                                    |  0.0850 |        | 
---------------------------------------------------------------

info UI33: performed report_timing for 0 sec (CPU time: 0 sec; MEM: RSS - 267M, CVMEM - 872M, PVMEM - 902M)
Nitro-SoC> report_timing -min_delay

 Timing Path to regB/out_reg[0]/D 
  
 Path Start Point : inputB[0] 
 Path End Point   : regB/out_reg[0] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Mode             : new_mode 
 Corner           : corner_0_0 
 Data Cell Derate : 1 
 Data Net Derate  : 1 
 Clock Cell Derate: Early = 1 / Late = 1 
 Clock Net Derate : Early = 1 / Late = 1 
 Path Type        : min 
 Path Group       : **inputs** 
 CRPR Threshold   : 5 
  
 Attributes  : U - cell is dont use 
             : M - cell is dont modify 
             : m - net is dont modify 
             : n - connected (sub)net is dont modify 
             : S - cell is size only 
             : F - cell is fixed 
             : C - cell has annotated timing constraints 
             : c - pin has annotated timing constraints 
             : A - cell is affected by case analysis 
             : L - Estimated latency 
             : O - CTS offset 
  
 Opt Attr    : I - is ideal 
             : L - is internal logic const 
             : K - is in clock network 
             : M - has only don't modify nets 
             : N - has no load pin 
             : D - has zero or multiple drivers 
             : G - is valid global net 
             : T - is not switching 

--------------------------------------------------------------------------------------------------------------------------------------------------------
| Pin                  | Cell    | Edge | Arrival | Delay  | Slew   | Wire Cap | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|----------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    inputB[0]         |         | Rise |  0.2000 | 0.0000 | 0.1000 | 0.615851 | 0.894119 | 1.50997   |         | 1       | 54.0402  | c    |          | 
|----------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/inp[0]       |         | Rise |  0.2000 | 0.0000 |        |          |          |           |         |         |          |      |          | 
|----------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/i_0_2/A2     | AND2_X1 | Rise |  0.2000 | 0.0000 | 0.1000 |          | 0.97463  |           |         |         |          |      |          | 
|----------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/i_0_2/ZN     | AND2_X1 | Rise |  0.2450 | 0.0450 | 0.0080 | 0.236089 | 1.06234  | 1.29843   |         | 1       | 54.0402  |      |          | 
|----------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/out_reg[0]/D | DFF_X1  | Rise |  0.2450 | 0.0000 | 0.0080 |          | 1.14029  |           |         |         |          | F    |          | 
--------------------------------------------------------------------------------------------------------------------------------------------------------

 Required Time Trace to regB/out_reg[0]/CK 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------
| Pin                          | Cell          | Edge | Arrival | Delay  | Slew   | Wire Cap | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    clk                       |               | Rise |  0.0000 | 0.0000 | 0.1000 | 5.30468  | 7.2488   | 12.5535   |         | 4       | 57.221   | c    | K        | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk                  |               | Rise |  0.0000 | 0.0000 |        |          |          |           |         |         |          |      |          | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk_gate_out_reg/CK  | CLKGATETST_X1 | Rise |  0.0000 | 0.0000 | 0.1000 |          | 1.8122   |           |         |         |          | FA   |          | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/clk_gate_out_reg/GCK | CLKGATETST_X1 | Rise |  0.0660 | 0.0660 | 0.0290 | 3.41242  | 7.59723  | 11.0096   |         | 8       | 57.221   | FA   | K        | 
|------------------------------+---------------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
|    regB/out_reg[0]/CK        | DFF_X1        | Rise |  0.0670 | 0.0010 | 0.0290 |          | 0.949653 |           |         |         |          | F    |          | 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

---------------------------------------------------------------
|                                          | Time    | Total  | 
|------------------------------------------+---------+--------|
| target clock sysclk_new_mode (rise edge) |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock cycle shift                 |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock propagated network latency  |  0.0670 | 0.0670 | 
|------------------------------------------+---------+--------|
| library hold check                       |  0.0140 | 0.0810 | 
|------------------------------------------+---------+--------|
| data required time                       |  0.0810 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| data arrival time                        |  0.2450 |        | 
|------------------------------------------+---------+--------|
| data required time                       | -0.0810 |        | 
|------------------------------------------+---------+--------|
| pessimism                                |  0.0000 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| slack                                    |  0.1640 |        | 
---------------------------------------------------------------

info UI33: performed report_timing for 0 sec (CPU time: 0 sec; MEM: RSS - 267M, CVMEM - 872M, PVMEM - 902M)
Nitro-SoC> report_placement
Report 'placement': Placement Report
Generated on Sun Dec 4 17:24:58 2022
  
--------------------------------------------------------------------------
|   Placement Bounding Box Statistics [integrationMult] length units:    |
|                                angstrom                                |
|-----------+-------------+----------------+---------------+-------------|
| Pin Count | Average     | Number Of Nets | Total Length  | Deviation   | 
|-----------+-------------+----------------+---------------+-------------|
| All       | 52486.6920  | 526            | 27608000.0000 | 61016.2076  | 
|-----------+-------------+----------------+---------------+-------------|
| 2         | 27692.0782  | 243            | 6729175.0000  | 25601.0549  | 
|-----------+-------------+----------------+---------------+-------------|
| 3         | 44141.2857  | 175            | 7724725.0000  | 27724.3054  | 
|-----------+-------------+----------------+---------------+-------------|
| 4         | 69805.3846  | 65             | 4537350.0000  | 38543.7504  | 
|-----------+-------------+----------------+---------------+-------------|
| 5         | 156907.5000 | 10             | 1569075.0000  | 146889.0738 | 
|-----------+-------------+----------------+---------------+-------------|
| >=6       | 213565.9091 | 33             | 7047675.0000  | 84149.6256  | 
--------------------------------------------------------------------------

Pin Count Statistics, Min:  2
Pin Count Statistics, Max:  13
Pin Count Statistics, Avg:  3.10266
Pin Count Statistics, Sum:  1632
  
--------------------------------------------------
|           Placement Area Statistics            |
|--------------------------------------+---------|
|                                      | Value   | 
|--------------------------------------+---------|
| Total Instance count                 | 513     | 
|--------------------------------------+---------|
| Total Leaf-cells in the netlist      | 507     | 
|--------------------------------------+---------|
| Total Number of Buf+Inv              | 105     | 
|--------------------------------------+---------|
| Total Number of Macros               | 0       | 
|--------------------------------------+---------|
| Total Number of Pads                 | 0       | 
|--------------------------------------+---------|
| Total Utilized Area (sq micron)      | 601.16  | 
|--------------------------------------+---------|
| Total Macro+Pad Area (sq micron)     | 0       | 
|--------------------------------------+---------|
| Total Logic Area (sq micron)         | 601.16  | 
|--------------------------------------+---------|
| Total Physical-Only Area (sq micron) | 0       | 
|--------------------------------------+---------|
| Total Buf+Inv Area (sq micron)       | 55.86   | 
|--------------------------------------+---------|
| Total Placeable Row Area (sq micron) | 1058.41 | 
|--------------------------------------+---------|
| Logic Cell Utilization (%)           | 56.79   | 
|--------------------------------------+---------|
| Silicon Area Utilization (%)         | 49.13   | 
--------------------------------------------------

  
-----------------------------------------------------------------------------------------------------------
|                                      Cell and Row Site Statistics                                       |
|----------------------------------+-----------+------------+--------------+-------------+----------------|
| Site Name                        | Row Count | Site Count | Placed Cells | Fixed Cells | Unplaced Cells | 
|----------------------------------+-----------+------------+--------------+-------------+----------------|
| FreePDK45_38x28_10R_NP_162NW_34O | 23        | 3979       | 471          | 36          | 0              | 
-----------------------------------------------------------------------------------------------------------

  
Cell Density Map Utilization - 9 objects 
    --- get_objects cell_density_rect -of [get_objects cell_density_map] -fi --->
0   | 0
5   | 0
10  | 0
15  | 0
20  | 0
25  | 0
30  | 0
35  | 0
40  | 0
45  | 0
50  |==================== 2
55  |========================================================================= 7
60  | 0
65  | 0
70  | 0
75  | 0
80  | 0
85  | 0
90  | 0
95  | 0
100 | 0
105 | 0
110 | 0
115 | 0
120 | 0
125 | 0
130 | 0
135 | 0
140 | 0
145 | 0
150 |
    V      get_property -name utilization -object %object%
Nitro-SoC> report_power
Report 'report_power': Power
Generated on Sun Dec 4 17:25:02 2022
  
-----------------------------------------------------------------------------------------------------------
|                                            Power (nanowatt)                                             |
|------------+----------+---------+----------+---------------+---------------+---------+---------+--------|
| corner     | mode     | logic   | internal | pin switching | net switching | dynamic | leakage | total  | 
|------------+----------+---------+----------+---------------+---------------+---------+---------+--------|
| corner_0_0 | new_mode | clock   |    66019 |          8771 |         16831 |   91622 |     228 |  91850 | 
|------------+----------+---------+----------+---------------+---------------+---------+---------+--------|
| corner_0_0 | new_mode | data    |   488046 |        291268 |         64633 |  843947 |   13514 | 857461 | 
|------------+----------+---------+----------+---------------+---------------+---------+---------+--------|
| corner_0_0 | new_mode | total   |   554066 |        300039 |         81464 |  935569 |   13743 | 949311 | 
|------------+----------+---------+----------+---------------+---------------+---------+---------+--------|
|            |          | Maximum |   554066 |        300039 |         81464 |  935569 |   13743 | 949311 | 
-----------------------------------------------------------------------------------------------------------

info UI33: performed report_power for 0 sec (CPU time: 0 sec; MEM: RSS - 267M, CVMEM - 872M, PVMEM - 902M)
Nitro-SoC> write_db -file db/route.db

warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
info UI36: Writing folded database file '/home/vlsi/Desktop/Lab5_2022/work/db/route.db'.
info Writing libraries...
info Writing design...
info Writing timer configuration...
info Writing SI configuration...
info Writing Parasitic Models and Extractor configuration...
info Writing Scan data
info Writing Trailing data
info Writing partitions...
info UI33: performed database save for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
Nitro-SoC> source flow_scripts/4_export.tcl


######################################################
#  Export Flow                                       #
# Version : 2019.1.R2                                #
#  Fix process antennas, add fillers & metal fill    #
#  Output design data.                               #
#  Control vars defined in flow_variables.tcl        #
#                                                    #
######################################################

Nitro-SoC> # config_shell -echo_script false
info UI33: performed source of flow_variables.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
info UI33: performed source of scr/kit_utils.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
Loading utility util::nrf_utils
  util::save_vars already loaded.  Use -force true to overwrite
Loading utility util::db_utils
NRF info: Checking flow variables for export
NRF info: Verifying user input for export
Storing TCL variables as db root property
info UI33: performed source of nrf_customization.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
Checking Antenna rules:
  OXIDE1:
metal1:
  No rules are defined
metal2:
  No rules are defined
metal3:
  No rules are defined
metal4:
  No rules are defined
metal5:
  No rules are defined
metal6:
  No rules are defined
metal7:
  No rules are defined
metal8:
  No rules are defined
metal9:
  No rules are defined
metal10:
  No rules are defined

Checking Antenna library:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
  All pins have Antenna area information

Antenna verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
Skip 35 nets with insufficient antenna information.

Report 'report_ant': Report Antenna
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------------
|                                   Antenna verification report                                    |
|-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
----------------------------------------------------------------------------------------------------

info UI33: performed Antenna verification for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
Antenna fixing progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
Skip 35 nets with insufficient antenna information.


Incremental timing update of 0 nets
Report 'report_ant': Report Antenna
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------------
|                                   Antenna verification report                                    |
|-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
----------------------------------------------------------------------------------------------------

info UI33: performed Antenna fixing for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 269M, CVMEM - 874M, PVMEM - 902M)
NRF info: Placing filler cells using lib cells: FILLCELL_X8 FILLCELL_X4 FILLCELL_X32 FILLCELL_X2 FILLCELL_X16 FILLCELL_X1

warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
info Removing existing filler cells.
info UI49: removed 0 core filler cells
info UI49: inserted 567 core filler cells
info DUM207: place_filler_cells: re-initialized cell-density map for partition integrationMult old bin-size 8x8 rows new bin-size 8x8 rows.
info DUM204: place_filler_cells: re-initialized cell-density map for partition integrationMult old max-util 100 new max-util 100.
info UI33: performed core filler cells placement for 0 sec (CPU time: 0 sec; MEM: RSS - 270M, CVMEM - 874M, PVMEM - 902M)
NRF info: Checking for unfilled gaps after filler cell insertion
info UI49: Found 0 unfilled gaps (0 minimum sites).
info UI33: performed check_unfilled_gaps for 0 sec (CPU time: 0 sec; MEM: RSS - 270M, CVMEM - 874M, PVMEM - 902M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 4     | 4      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 270M, CVMEM - 874M, PVMEM - 902M)
NRF info: Number of DRC errors increased after filler cell insertion (4 > 0). Running DRC clean-up 

DRC cleaning progress:
Iteration  0 on  metal1 layer (     4 wins): 20% 50% 70% 100% 
Iteration  0 on  metal2 layer (     1 wins): 100% 
Iteration  0 on  metal3 layer (     4 wins): 20% 50% 70% 100% 
Iteration  0 on  metal4 layer (     1 wins): 100% 
Iteration  0 on  metal5 layer (     1 wins): 100% 
Iteration  0 on  metal6 layer (     1 wins): 100% 
Iteration  0 on  metal7 layer (     1 wins): 100% 
Iteration  0 on  metal8 layer (     1 wins): 100% 
Iteration  0 on  metal9 layer (     1 wins): 100% 
Iteration  0 on metal10 layer (     1 wins): 100% 
Iteration  1 on  metal1 layer (     2 wins): 50% 100% 

--------------------------------------------------------------------------------------------------------------------
|                                               DRC cleaning report                                                |
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|               | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Removed vias  | 4     | 4      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Removed wires | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Clipped wires | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Modified nets | 4     | 4      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
--------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 270M, CVMEM - 874M, PVMEM - 902M)
warning UI1291: The size of '-column_names' does not equal to the number of columns in '-values' arg.
---------------------------------
|  Start run_route_timing flow  |
|-----------------+-------------|
| Argument        | Value       | 
|-----------------+-------------|
| cpus            | 2           | 
|-----------------+-------------|
| messages        | default     | 
|-----------------+-------------|
| timing_mode     | si          | 
|-----------------+-------------|
| preserve_clocks | auto        | 
|-----------------+-------------|
| save_db_stages  |             | 
|-----------------+-------------|
| stop_after      | false       | 
|-----------------+-------------|
| start_from      | false       | 
|-----------------+-------------|
| resume          | false       | 
|-----------------+-------------|
| skip_stages     |             | 
|-----------------+-------------|
| run_stages      |             | 
|-----------------+-------------|
| mode            | repair      | 
|-----------------+-------------|
| trial           | false       | 
|-----------------+-------------|
| dump_qor_stages |             | 
|-----------------+-------------|
| user_params     | -drc_effort | 
---------------------------------

NRF info: Setting up run_route_timing flow ...

warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
info UI33: performed update timing for 0 sec (CPU time: 0 sec; MEM: RSS - 270M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
Routing lib vias have been created
Routing lib vias have been selected
info UI30: performing congestion analysis on partition integrationMult (started at Sun Dec 4 17:25:20 2022)

Congestion ratio stats: min = 0.06, max = 0.45, mean = 0.29 
At threshold 1.17, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)
At threshold 0.99, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)
At threshold 0.87, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)

-------------------------------------------------
| Grade = A; the partition should route easily. |
-------------------------------------------------

info UI33: performed congestion analysis for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
|                                                                           Current Parameter Values for 'config_route_timing'                                                                            |
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| Name                     | Description                                                     | Value      | Default    | Modified | Value_type | Enum                           | Persistent | User_level | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| dvia_mode                | Specifies the mode of double via replacement                    | dfm        | timing     | true     | N/A        | dfm none timing                | true       | normal     | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_gr_channel   | Specifies effort to preserve channel for follow_gr nets in      | 90         | 0          | true     | N/A        |                                | true       | advanced   | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_gr_layer     | Specifies effort to preserve layer for follow_gr nets in        | 100        | 0          | true     | N/A        |                                | true       | advanced   | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| ds_max_count             | Specifies the maximum allowed number of dominant scenarios      | 6          | 0          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| ds_threshold             | Specifies the percentage threshold for dominant scenarios       | 80         | 0          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| fr_topo_cri_priority     | Specifies priority value for topology critical nets in          | 0          | 50         | true     | N/A        |                                | true       | developer  | 
|                          | route_final (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| low_power_effort         | Specifies low power effort                                      | low        | none       | true     | N/A        | high low medium none           | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| opt_cdm_model            | Specifies advanced CDM model                                    | delta_area | delta_area | true     | N/A        | delta_area dynamic_bloat none  | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| opt_cpus                 | Specifies number of cpus for optimizer ('0' - distributed)      | 4          | 4          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| si_mcmm                  | Specifies to look at all the enabled corners in si_delay_repair | true       | false      | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_dont_route_clocks     | Specifies to prohibit route_track from touching existing clock  | false      | true       | true     | N/A        |                                | true       | developer  | 
|                          | routing                                                         |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_all_gr_layer | Specifies effort to preserve layer for all the nets in          | 100        | 0          | true     | N/A        |                                | true       | developer  | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


RRT info: Running run_route_timing in 'repair' mode ...

RRT info: Start stage 'check'
RRT info: User event handler 'before check' completed successfully
-----------------------------
|  Check routing lib vias   |
|-------+---------+---------|
| layer | regular | minarea | 
|-------+---------+---------|
| via1  | ok      | none    | 
|-------+---------+---------|
| via2  | ok      | none    | 
|-------+---------+---------|
| via3  | ok      | none    | 
|-------+---------+---------|
| via4  | ok      | none    | 
|-------+---------+---------|
| via5  | ok      | none    | 
|-------+---------+---------|
| via6  | ok      | none    | 
|-------+---------+---------|
| via7  | ok      | none    | 
-----------------------------

RRT info: Stage 'check' completed successfully
RRT info: User event handler 'after check' completed successfully
RRT info: Start stage 'open'
RRT info: User event handler 'before open' completed successfully
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 4         | 4    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

  
-----------------------------------------------
| LVS open distance distribution (nanometers) |
|--------+-------+----------------------------|
|        | Total | 0.00                       | 
|--------+-------+----------------------------|
| % open | 100   | 100.00                     | 
|--------+-------+----------------------------|
| # open | 4     | 4                          | 
-----------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
LVS cleaning progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 4         | 4    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

  
-----------------------------------------------
| LVS open distance distribution (nanometers) |
|--------+-------+----------------------------|
|        | Total | 0.00                       | 
|--------+-------+----------------------------|
| % open | 100   | 100.00                     | 
|--------+-------+----------------------------|
| # open | 4     | 4                          | 
-----------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:25:20 2022)
Start Final Routing in simple DRC mode on 1 cpus

-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1636 | 
|-------------------+------+------|
| To be routed :    | 527  | 1636 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 1    | 4    | 
|-------------------+------+------|
| To be skipped :   | 1    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 1    | 0    | 
-----------------------------------

Check opens ...
Longest open in net 'outA/n_1' of length=0
Total opens=4 (nets=4)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M

Run(1) 'Objective: fix opens'   ...
Result=end(begin): opens=0(4), viols=0(0)
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M

Finish Final Routing ...
Number of touched nets: 4
Number of changed nets: 4

info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
LVS cleaning progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:25:20 2022)
Start Final Routing in simple DRC mode on 1 cpus
  with 'number' acceptance 

-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1636 | 
|-------------------+------+------|
| To be routed :    | 527  | 1636 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 1    | 4    | 
|-------------------+------+------|
| To be skipped :   | 1    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 1    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:01, Elapsed time: 00:00:00, Memory: 874M


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:25:20 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 271M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
RRT info: Stage 'open' completed successfully
RRT info: User event handler 'after open' completed successfully
RRT info: Start stage 'drc'
RRT info: User event handler 'before drc' completed successfully
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT warning: User-specified value 'high' for option 'drc_effort' overrides previous ''
RRT warning: User-specified value 'number' for option 'drc_accept' overrides previous ''
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:25:20 2022)
Start Final Routing in full DRC mode on 1 cpus
  with 'number' acceptance 
  with expensive effort

-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1636 | 
|-------------------+------+------|
| To be routed :    | 527  | 1636 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 1    | 4    | 
|-------------------+------+------|
| To be skipped :   | 1    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 1    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 272M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 

Report 'tdro_drc': Report Drc
Generated on Sun Dec 4 17:25:21 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 272M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)

RRT info: Number of remaining shorts: 0
RRT info: Number of remaining DRCs  : 0

Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT info: Stage 'drc' completed successfully
RRT info: User event handler 'after drc' completed successfully
RRT info: Start stage 'dp'
RRT info: User event handler 'before dp' completed successfully
RRT info: Stage 'dp' skipped
RRT info: Start stage 'dvia'
RRT info: User event handler 'before dvia' completed successfully
RRT warning: Configured value 'dfm' for option 'dvia_mode' overrides previous 'timing'
DFM via replacement progress:
Processing via1: 30% 60% 100% 
Processing via2: 50% 100% 
Processing via3: 30% 60% 100% 
Processing via4: 50% 100% 
Processing via5: 50% 100% 
Processing via6: 50% 100% 
Processing via7: 100% 

Incremental timing update of 4 nets

Report 'report_dfm_rvi': DFM via replacement report
Generated on Sun Dec 4 17:25:21 2022
  
--------------------------------------------------------------------------------------------
|                                DFM via replacement report                                |
|-------------------+-------+------+------+------+------+------+------+------+------+------|
|                   | Total | via1 | via2 | via3 | via4 | via5 | via6 | via7 | via8 | via9 | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Checked vias      | 3883  | 1606 | 2017 | 258  | 2    | 0    | 0    | 0    | 0    | 0    | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Replaced vias     | 4     | 4    | 0    | 0    | 0    | 0    | 0    | 0    | 0    | 0    | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Replaced vias (%) | 0.10  | 0.25 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
--------------------------------------------------------------------------------------------

----------------------------------------------------------------------------------------------------------
|                                      Via statistics in the design                                      |
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
|                            | TOTAL  | via1  | via2  | via3  | via4  | via5 | via6 | via7 | via8 | via9 | 
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
| Number of vias  (thousand) | 3.89   | 1.61  | 2.03  | 0.26  | 0.00  | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
| Vias (%)                   | 100.00 | 41.25 | 52.07 | 6.63  | 0.05  | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
| Single vias (%)            | 14.08  | 14.57 | 14.80 | 5.04  | 50.00 | 0    | 0    | 0    | 0    | 0    | 
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
| Double vias (%)            | 85.92  | 85.43 | 85.20 | 94.96 | 50.00 | 0    | 0    | 0    | 0    | 0    | 
|----------------------------+--------+-------+-------+-------+-------+------+------+------+------+------|
| Multi vias (%)             | 0.00   | 0.00  | 0.00  | 0.00  | 0.00  | 0    | 0    | 0    | 0    | 0    | 
----------------------------------------------------------------------------------------------------------

info UI33: performed Via replacement for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT warning: User-specified value 'high' for option 'drc_effort' overrides previous ''
RRT warning: User-specified value 'number' for option 'drc_accept' overrides previous ''
RRT warning: User-specified value 'number_improved' for option 'drc_accept' overrides previous 'number'
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:25:21 2022)
Start Final Routing in full DRC mode on 1 cpus
  with 'number' acceptance 
  with expensive effort

-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1636 | 
|-------------------+------+------|
| To be routed :    | 527  | 1636 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 1    | 4    | 
|-------------------+------+------|
| To be skipped :   | 1    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 1    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 874M

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 

Report 'tdro_drc': Report Drc
Generated on Sun Dec 4 17:25:21 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M, PRSS - 230M)

RRT info: Number of remaining shorts: 0
RRT info: Number of remaining DRCs  : 0

Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT info: Stage 'dvia' completed successfully
RRT info: User event handler 'after dvia' completed successfully
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
Nitro-SoC> # config_shell -ignore_errors false
Nitro-SoC> # config_application -cpus 1
Nitro-SoC> # config_timing -cpus 2
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
Nitro-SoC> # config_default_value -command route_global -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_global -argument messages -value normal
Nitro-SoC> # config_default_value -command route_track -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_track -argument messages -value normal
Nitro-SoC> # config_default_value -command route_final -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_final -argument messages -value normal
Nitro-SoC> # config_default_value -command route_si_repair -argument check -value  
Nitro-SoC> # config_default_value -command route_si_repair -argument messages -value normal
Nitro-SoC> # config_route_final -opt_strict_drc false
Nitro-SoC> # fk_msg -set_prompt NRF
Nitro-SoC> # new_config_flow -name flow_msg_prompt -quiet
Nitro-SoC> # new_config_flow -name flow_msg_prompt -value NRF -descr Flow prefix - will appear in all messages printed by flow_msg -quiet
Nitro-SoC> # config_shell -level normal
Nitro-SoC> # fk_msg -set_verbosity_filter info
Nitro-SoC> # new_config_flow -name verbose_level
Nitro-SoC> # new_config_flow -name verbose_level -value info -quiet
Nitro-SoC> # config_shell -echo false
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:25:21 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M)
info UI34: no objects were found for '*'
info UI36: Writing Verilog file 'output/integrationMult.v.gz'.
info UI33: performed verilog write for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M)
info UI36: Writing DEF file 'output/integrationMult.def.gz'.
info UI33: performed DEF write for 0 sec (CPU time: 0 sec; MEM: RSS - 273M, CVMEM - 874M, PVMEM - 902M)
Annotate antenna information on 35 pins from 35 nets
Antenna verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
NRF warning: No GDS layer-map file specified in flow variable MGC_gds_layer_map_file.  GDS will not be written
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
info UI36: Writing folded database file '/home/vlsi/Desktop/Lab5_2022/work/dbs/export.db'.
info Writing design...
info Writing timer configuration...
info Writing SI configuration...
info Writing Parasitic Models and Extractor configuration...
info Writing Scan data
info Writing Trailing data
info Writing partitions...
info UI33: performed database save for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 902M)
NRF info: Reports started Sun Dec 04 17:25:21 EET 2022
Report 'application': Application Report
Generated on Sun Dec 4 17:25:21 2022
  
-------------------------------------------------------------------------------------------
|                      Application CPU time and memory usage status                       |
|-----------------------------------------------------------------------------------------|
| Total memory (MBytes)    | 874                                                          | 
| Heap memory (MBytes)     | 367                                                          | 
| Resident memory (MBytes) | 274                                                          | 
| CPU time (minutes)       | 0.48                                                         | 
| Elapsed time (minutes)   | 5.77                                                         | 
| Load Averages            | 0.81 0.94 0.89                                               | 
| Build                    | 1.68700.2.290                                                | 
| Version                  | version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019 | 
| Calibre Version          | Calibre library v2019.2_14.13                                | 
| Computer Name            | localhost.localdomain                                        | 
| Cores                    | 1                                                            | 
| Frequency (GHz)          | 2.6                                                          | 
| Execution mode           | 64                                                           | 
| Process id               | 6838                                                         | 
| Interaction mode         | window                                                       | 
| Log file                 | nitro.log                                                    | 
| Journal file             | nitro.jou                                                    | 
| Working directory        | /home/vlsi/Desktop/Lab5_2022/work/.nitro_tmp_localhost.local | 
|                          domain_6838                                                  | 
-------------------------------------------------------------------------------------------

NRF info: Writing Timing Summary Reports Sun Dec 04 17:25:21 EET 2022
info UI54: redirecting output of 
            report_mcmm_variation 
            if { [llength [get_corners -filter "@setup==true && @enable==true"]] } {
                report_path_group -violators_only -sort wns
                report_slack_histogram -num_critical_bins 50 
            } 
            if { [llength [get_corners -filter "@hold==true && @enable==true"]] } {
                report_path_group -violators_only -sort wns -min
                report_slack_histogram -min  -num_critical_bins 50 
            }
 to reports/export_timing_summary.rpt
Report 'report_mcmm_variation': MCMM Variation
Generated on Sun Dec 4 17:25:21 2022
  
---------------------------------------------------------------
| MCMM variability report for design 'integrationMult' (nano) |
|-------------------------------------------------------------|
| MODE CORNER WNS TNS #Endpts WHS THS #Endpts                 | 
---------------------------------------------------------------

info UI33: performed report_mcmm_variation for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 902M)
Report 'report_path_group': Path Group
Generated on Sun Dec 4 17:25:21 2022
  
-------------------------------------------------------------------------------------------
|                               PATH GROUPS (SETUP) (nano)                                |
|-----------------------------------------------------------------------------------------|
| QOR Weight Margin TNS Range Endpoints Violating Endpoints Violating Endpoints % WNS TNS | 
-------------------------------------------------------------------------------------------

info UI33: performed report_path_group for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
SLACK HISTOGRAM
---------------
Select : SELECT_LATE

---------------------------------------------
| Slack           # End Pts Total # End Pts | 
|-------------------------------------------|
| 0.0000 - 0.7490 35        35              | 
| 0.7500 - 1.4990 17        52              | 
---------------------------------------------

info UI33: performed report_slack_histogram for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
Report 'report_path_group': Path Group
Generated on Sun Dec 4 17:25:21 2022
  
-------------------------------------------------------------------------------------------
|                                PATH GROUPS (HOLD) (nano)                                |
|-----------------------------------------------------------------------------------------|
| QOR Weight Margin TNS Range Endpoints Violating Endpoints Violating Endpoints % WNS TNS | 
-------------------------------------------------------------------------------------------

info UI33: performed report_path_group for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
SLACK HISTOGRAM
---------------
Select : SELECT_EARLY

---------------------------------------------
| Slack           # End Pts Total # End Pts | 
|-------------------------------------------|
| 0.0000 - 0.2490 27        27              | 
| 0.2500 - 0.4990 25        52              | 
---------------------------------------------

info UI33: performed report_slack_histogram for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
NRF info: Writing Detailed Setup Timing Path Reports Sun Dec 04 17:25:21 EET 2022
info UI54: redirecting output of 
           if { [llength [get_corners -filter "@setup==true && @enable==true"]] } {
                report_timing -max_paths $num_max_path
           } 
 to reports/export_max_timing_paths.rpt
NRF info: Writing Detailed Hold Timing Path Reports Sun Dec 04 17:25:21 EET 2022
info UI54: redirecting output of 
           if { [llength [get_corners -filter "@hold==true && @enable==true"]] } {
               report_timing -max_paths $num_max_path -min 
           } 
 to reports/export_min_timing_paths.rpt
NRF info: Writing Timing Drc Reports Sun Dec 04 17:25:22 EET 2022
info UI54: redirecting output of 
           report_constraint -max_tran -all_violators -verbose
 to reports/export_timing_drc.rpt
NRF info: Writing Physical Reports Sun Dec 04 17:25:22 EET 2022
info UI54: redirecting output of 
           check_lvs -open_distribution
           check_drc  
           check_placement
           report_region_utilization
 to reports/export_physical.rpt
NRF info: Writing Power Reports Sun Dec 04 17:25:22 EET 2022
info UI54: redirecting output of 
               report_power_summary
               report_analysis_corner
 to reports/export_power.rpt
Report 'report_power_summary': Power
Generated on Sun Dec 4 17:25:22 2022
  
--------------------------------------------------------------------------
|                        Power Summary (nanowatt)                        |
|------------------------------------------------------------------------|
| Component          Internal Switching  Dynamic Leakage  Total  Percent | 
|------------------------------------------------------------------------|
| Entire design        554066    381503   935569   13743  949311  100.00 | 
|                                                                        | 
| Power of all cells   554066    300039   854104   13743  867847   91.42 | 
|   Clock cells         66019      8771    74790     228   75019    7.90 | 
|   Data cells         488046    291268   779314   13514  792829   83.52 | 
|     Combinational    224697    261405   486102   11017  497119   52.37 | 
|     Registers        263242     29863   293105    2497  295602   31.14 | 
|     Macros                0         0        0       0       0    0.00 | 
|     Physical              0         0        0       0       0    0.00 | 
|                                                                        | 
| Power of all nets               81464    81464           81464    8.58 | 
|   Clock nets                    16831    16831           16831    1.77 | 
|     Clock leaves                10413    10413           10413    1.10 | 
|   Data nets                     64633    64633           64633    6.81 | 
--------------------------------------------------------------------------

info UI33: performed report_power_summary for 0 sec (CPU time: 0 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
------------------------------------------------------------------------------------------------------------------------------------------------
| Corner     Enable Setup Hold  CRPR       SI    Power            EM   Voltage Drop DRC        Process                    RC Temp Scale Factor | 
|----------------------------------------------------------------------------------------------------------------------------------------------|
| slow       false  true  false setup_hold none  leakage          none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
| fast       false  false false setup_hold none  leakage          none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
| corner_0_0 true   true  true  setup_hold delay leakage, dynamic none none         trans, cap new_rcmaster_techFreePDK45 25      1            | 
------------------------------------------------------------------------------------------------------------------------------------------------

NRF info: Reports completed Sun Dec 04 17:25:22 EET 2022
NRF info: Because Nitro is not being exited, supply nets are not propagated and power netlist is not output by default.

info UI33: performed source of flow_scripts/4_export.tcl for 2 sec (CPU time: 1 sec; MEM: RSS - 274M, CVMEM - 874M, PVMEM - 904M)
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
info UI36: Writing folded database file '/home/vlsi/Desktop/Lab5_2022/work/db/final.db'.
info Writing libraries...
info Writing design...
info Writing timer configuration...
info Writing SI configuration...
info Writing Parasitic Models and Extractor configuration...
info Writing Scan data
info Writing Trailing data
info Writing partitions...
info UI33: performed database save for 0 sec (CPU time: 0 sec; MEM: RSS - 276M, CVMEM - 881M, PVMEM - 904M)
info UI33: performed sdf write for 0 sec (CPU time: 0 sec; MEM: RSS - 276M, CVMEM - 881M, PVMEM - 904M)
info UI36: Writing Verilog file 'multiplier.route.v'.
info UI33: performed verilog write for 0 sec (CPU time: 0 sec; MEM: RSS - 276M, CVMEM - 881M, PVMEM - 904M)
info Removing existing filler cells.
info UI49: removed 567 core filler cells
info UI49: inserted 567 core filler cells
info DUM207: place_filler_cells: re-initialized cell-density map for partition integrationMult old bin-size 8x8 rows new bin-size 8x8 rows.
info DUM204: place_filler_cells: re-initialized cell-density map for partition integrationMult old max-util 100 new max-util 100.
info UI33: performed core filler cells placement for 0 sec (CPU time: 0 sec; MEM: RSS - 276M, CVMEM - 881M, PVMEM - 904M)
info Top port for supply net 'VDD' on partition 'integrationMult' already exists.
warning Creating top port for supply net 'VSS' on partition 'integrationMult' as it is a supply net within its power domain.
warning UI1253: Write verilog and exit Nitro session immediately. write_db is disabled.
info UI36: Writing Verilog file 'output/integrationMult.power.v.gz'.
info UI33: performed verilog write for 0 sec (CPU time: 0 sec; MEM: RSS - 276M, CVMEM - 881M, PVMEM - 904M)
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 59 (can't read "MGC_topDesign": no such variable).
TCL: can't read "MGC_topDesign": no such variable
Nitro-SoC> group_path -name I2R -from [all_inputs]
group_path -name I2O -from [all_inputs] -to [all_outputs]
group_path -name R2O -to [all_outputs] 
Nitro-SoC> source flow_scripts/0_import.tcl

#####################################################
## Nitro Reference Flow : Import Stage             ##
## Version : 2019.1.R2                             ##
## Imports technology & design info to prepare     ##
## design for NRF place and route.                 ##
#####################################################

info UI33: performed source of import_variables.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 277M, CVMEM - 881M, PVMEM - 904M)
NRF info: Sourcing standard NRF script /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/ref_flows/tcl/scr/kit_utils.tcl
info UI33: performed source of /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/ref_flows/tcl/scr/kit_utils.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 277M, CVMEM - 881M, PVMEM - 904M)
Loading utility util::nrf_utils
Loading utility util::save_nrf_import_vars
NRF info: Checking import variables
NRF warning: Array variable MGC_aocv_library is not defined. Please review/update import_variables.tcl.
Storing TCL variables as db root property
warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
NRF info: MGC_libDbPath :  doesn't exist, Running library setup part of import stage and generate libs.db
NRF info: Since TECHNO RULE File is not provided or does not exist, technology rules must come from tech lef
NRF info: Reading TECH LEF File
info UI35: Reading LEF file '/home/vlsi/Desktop/Lab5_2022/lib_data/NangateOpenCellLibrary.tech.lef'.
info SDBLEF119: Processing 'NangateOpenCellLibrary.tech' library...
error SDBLEF35: Library 'NangateOpenCellLibrary.tech' already exists.
error UI26: Script file 'flow_scripts/0_import.tcl' execution failed (and stopped) at line 63 (read_lef -file /home/vlsi/Desktop/Lab5_2022/lib_data/NangateOpenCellLibrary.tech.lef).
Nitro-SoC> setup_nrf
Loading utility util::nrf_utils
NRF error: Can not overwrite file/dir flow_scripts. Please move/remove, start from scratch and re-run
NRF error: Can not overwrite file/dir scr. Please move/remove, start from scratch and re-run
NRF error: You can use setup_nrf -clean_dir option to delete all files
Nitro-SoC> source flow_scripts/3_route.tcl > LOGs/route.log

info UI54: redirecting output of source to LOGs/route.log
info UI54: redirecting output of report_route_nets to /dev/null
info UI54: redirecting output of check_lvs -nets $tdro::env::data_nets -name gr_lvs -global -quiet to /dev/null
info UI54: redirecting output of report_route_nets to /dev/null
info UI54: redirecting output of report_route_nets to /dev/null
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "**global**"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Nitro-SoC> report_timing -max_delay

 Timing Path to outB/out_reg[6]/D 
  
 Path Start Point : regB/out_reg[4] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Path End Point   : outB/out_reg[6] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Mode             : new_mode 
 Corner           : corner_0_0 
 Data Cell Derate : 1 
 Data Net Derate  : 1 
 Clock Cell Derate: Early = 1 / Late = 1 
 Clock Net Derate : Early = 1 / Late = 1 
 Path Type        : max 
 Path Group       : sysclk_new_mode 
 CRPR Threshold   : 5 
  
 Attributes  : U - cell is dont use 
             : M - cell is dont modify 
             : m - net is dont modify 
             : n - connected (sub)net is dont modify 
             : S - cell is size only 
             : F - cell is fixed 
             : C - cell has annotated timing constraints 
             : c - pin has annotated timing constraints 
             : A - cell is affected by case analysis 
             : L - Estimated latency 
             : O - CTS offset 
  
 Opt Attr    : I - is ideal 
             : L - is internal logic const 
             : K - is in clock network 
             : M - has only don't modify nets 
             : N - has no load pin 
             : D - has zero or multiple drivers 
             : G - is valid global net 
             : T - is not switching 

----------------------------------------------------------------------------------------------------------------------------------------------------------
| Pin                 | Cell      | Edge | Arrival | Delay  | Slew   | Wire Cap  | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| regB/out_reg[4]/CK  | DFF_X1    | Rise |  0.0660 | 0.0660 | 0.0290 |           | 0.949653 |           |         |         |          | F    |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| regB/out_reg[4]/Q   | DFF_X1    | Rise |  0.2110 | 0.1450 | 0.0580 | 5.84473   | 17.8586  | 23.7033   |         | 12      | 54.0402  | F    |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| regB/out[4]         |           | Rise |  0.2110 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/inputB[4]      |           | Rise |  0.2110 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/inputB[4]  |           | Rise |  0.2110 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_88/A     | INV_X1    | Rise |  0.2120 | 0.0010 | 0.0580 |           | 1.70023  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_88/ZN    | INV_X1    | Fall |  0.2370 | 0.0250 | 0.0190 | 2.18398   | 4.89599  | 7.07998   |         | 3       | 57.221   |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_242/B1   | OAI21_X1  | Fall |  0.2370 | 0.0000 | 0.0190 |           | 1.45983  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_242/ZN   | OAI21_X1  | Rise |  0.2900 | 0.0530 | 0.0390 | 1.2079    | 4.93752  | 6.14542   |         | 3       | 54.0402  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_241/A    | INV_X1    | Rise |  0.2900 | 0.0000 | 0.0390 |           | 1.70023  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_241/ZN   | INV_X1    | Fall |  0.3000 | 0.0100 | 0.0100 | 0.150863  | 1.62635  | 1.77721   |         | 1       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_238/A    | AOI21_X1  | Fall |  0.3000 | 0.0000 | 0.0100 |           | 1.53534  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_238/ZN   | AOI21_X1  | Rise |  0.3610 | 0.0610 | 0.0410 | 0.858606  | 4.9924   | 5.851     |         | 3       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_236/A2   | NOR2_X1   | Rise |  0.3610 | 0.0000 | 0.0410 |           | 1.65135  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_236/ZN   | NOR2_X1   | Fall |  0.3810 | 0.0200 | 0.0140 | 0.402108  | 3.2527   | 3.65481   |         | 2       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_286/A    | AOI21_X1  | Fall |  0.3810 | 0.0000 | 0.0140 |           | 1.53534  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_286/ZN   | AOI21_X1  | Rise |  0.4410 | 0.0600 | 0.0380 | 0.94542   | 4.30637  | 5.25179   |         | 3       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_283/A2   | OR2_X1    | Rise |  0.4410 | 0.0000 | 0.0380 |           | 0.941939 |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_283/ZN   | OR2_X1    | Rise |  0.4800 | 0.0390 | 0.0120 | 0.517263  | 3.34105  | 3.85832   |         | 2       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_282/A2   | NAND2_X1  | Rise |  0.4800 | 0.0000 | 0.0120 |           | 1.6642   |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_282/ZN   | NAND2_X1  | Fall |  0.5000 | 0.0200 | 0.0120 | 0.710181  | 3.81376  | 4.52395   |         | 2       | 58.6272  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_312/B1   | AOI221_X1 | Fall |  0.5000 | 0.0000 | 0.0120 |           | 1.57405  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_312/ZN   | AOI221_X1 | Rise |  0.5860 | 0.0860 | 0.0560 | 0.291867  | 3.36228  | 3.65415   |         | 2       | 58.0804  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_311/A    | INV_X1    | Rise |  0.5860 | 0.0000 | 0.0560 |           | 1.70023  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_311/ZN   | INV_X1    | Fall |  0.6020 | 0.0160 | 0.0150 | 0.523629  | 3.18932  | 3.71295   |         | 2       | 58.0804  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_341/A1   | NAND2_X1  | Fall |  0.6020 | 0.0000 | 0.0150 |           | 1.5292   |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_341/ZN   | NAND2_X1  | Rise |  0.6200 | 0.0180 | 0.0100 | 0.233302  | 1.6642   | 1.8975    |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_340/A2   | NAND2_X1  | Rise |  0.6200 | 0.0000 | 0.0100 |           | 1.6642   |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_340/ZN   | NAND2_X1  | Fall |  0.6410 | 0.0210 | 0.0180 | 0.794415  | 4.12747  | 4.92188   |         | 3       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_318/A1   | OR2_X1    | Fall |  0.6410 | 0.0000 | 0.0180 |           | 0.792385 |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_318/ZN   | OR2_X1    | Fall |  0.7030 | 0.0620 | 0.0160 | 0.930618  | 7.49661  | 8.42723   |         | 5       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_374/A1   | AND3_X1   | Fall |  0.7030 | 0.0000 | 0.0160 |           | 0.86614  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_374/ZN   | AND3_X1   | Fall |  0.7380 | 0.0350 | 0.0070 | 0.609115  | 1.63225  | 2.24137   |         | 1       | 56.5944  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_376/C1   | AOI221_X1 | Fall |  0.7380 | 0.0000 | 0.0070 |           | 1.38349  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_376/ZN   | AOI221_X1 | Rise |  0.7860 | 0.0480 | 0.0440 | 0.3573    | 1.647    | 2.0043    |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_378/B1   | AOI21_X1  | Rise |  0.7860 | 0.0000 | 0.0440 |           | 1.647    |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_378/ZN   | AOI21_X1  | Fall |  0.8130 | 0.0270 | 0.0180 | 0.424654  | 3.27212  | 3.69678   |         | 2       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_379/A    | INV_X1    | Fall |  0.8130 | 0.0000 | 0.0180 |           | 1.54936  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_379/ZN   | INV_X1    | Rise |  0.8360 | 0.0230 | 0.0120 | 0.598149  | 3.24604  | 3.84418   |         | 2       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_409/B1   | AOI21_X1  | Rise |  0.8360 | 0.0000 | 0.0120 |           | 1.647    |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_409/ZN   | AOI21_X1  | Fall |  0.8550 | 0.0190 | 0.0120 | 0.45757   | 3.23394  | 3.69151   |         | 2       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_407/B2   | OAI21_X1  | Fall |  0.8550 | 0.0000 | 0.0120 |           | 1.55833  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_407/ZN   | OAI21_X1  | Rise |  0.8890 | 0.0340 | 0.0200 | 0.335813  | 1.67072  | 2.00653   |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_404/A    | OAI21_X1  | Rise |  0.8890 | 0.0000 | 0.0200 |           | 1.67072  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_404/ZN   | OAI21_X1  | Fall |  0.9110 | 0.0220 | 0.0100 | 0.321357  | 1.70023  | 2.02159   |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_403/A    | INV_X1    | Fall |  0.9110 | 0.0000 | 0.0100 |           | 1.54936  |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/i_403/ZN   | INV_X1    | Rise |  0.9220 | 0.0110 | 0.0060 | 0.0073601 | 0.918145 | 0.925505  |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/i_0/result[14] |           | Rise |  0.9220 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| mult/result[14]     |           | Rise |  0.9220 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| outB/inp[6]         |           | Rise |  0.9220 | 0.0000 |        |           |          |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| outB/i_0_8/A1       | AND2_X1   | Rise |  0.9220 | 0.0000 | 0.0060 |           | 0.918145 |           |         |         |          |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| outB/i_0_8/ZN       | AND2_X1   | Rise |  0.9500 | 0.0280 | 0.0080 | 0.190265  | 1.14029  | 1.33056   |         | 1       | 52.7934  |      |          | 
|---------------------+-----------+------+---------+--------+--------+-----------+----------+-----------+---------+---------+----------+------+----------|
| outB/out_reg[6]/D   | DFF_X1    | Rise |  0.9500 | 0.0000 | 0.0080 |           | 1.14029  |           |         |         |          | F    |          | 
----------------------------------------------------------------------------------------------------------------------------------------------------------

---------------------------------------------------------------
|                                          | Time    | Total  | 
|------------------------------------------+---------+--------|
| target clock sysclk_new_mode (rise edge) |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock cycle shift                 |  1.0000 | 1.0000 | 
|------------------------------------------+---------+--------|
| target clock propagated network latency  |  0.0630 | 1.0630 | 
|------------------------------------------+---------+--------|
| library setup check                      | -0.0280 | 1.0350 | 
|------------------------------------------+---------+--------|
| data required time                       |  1.0350 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| data required time                       |  1.0350 |        | 
|------------------------------------------+---------+--------|
| data arrival time                        | -0.9500 |        | 
|------------------------------------------+---------+--------|
| pessimism                                |  0.0000 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| slack                                    |  0.0850 |        | 
---------------------------------------------------------------

info UI33: performed report_timing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
Nitro-SoC> report_timing -min_delay

 Timing Path to regB/out_reg[0]/D 
  
 Path Start Point : inputB[0] 
 Path End Point   : regB/out_reg[0] (DFF_X1) 
                       (rising edge-triggered flip-flop clocked by sysclk_new_mode) 
 Mode             : new_mode 
 Corner           : corner_0_0 
 Data Cell Derate : 1 
 Data Net Derate  : 1 
 Clock Cell Derate: Early = 1 / Late = 1 
 Clock Net Derate : Early = 1 / Late = 1 
 Path Type        : min 
 Path Group       : I2R 
 CRPR Threshold   : 5 
  
 Attributes  : U - cell is dont use 
             : M - cell is dont modify 
             : m - net is dont modify 
             : n - connected (sub)net is dont modify 
             : S - cell is size only 
             : F - cell is fixed 
             : C - cell has annotated timing constraints 
             : c - pin has annotated timing constraints 
             : A - cell is affected by case analysis 
             : L - Estimated latency 
             : O - CTS offset 
  
 Opt Attr    : I - is ideal 
             : L - is internal logic const 
             : K - is in clock network 
             : M - has only don't modify nets 
             : N - has no load pin 
             : D - has zero or multiple drivers 
             : G - is valid global net 
             : T - is not switching 

-----------------------------------------------------------------------------------------------------------------------------------------------------
| Pin               | Cell    | Edge | Arrival | Delay  | Slew   | Wire Cap | Pin Cap  | Total Cap | Derate  | Fanout  | Bin Util | Attr | Opt Attr | 
|-------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
| inputB[0]         |         | Rise |  0.2000 | 0.2000 | 0.1000 | 0.605312 | 0.894119 | 1.49943   |         | 1       | 54.0402  | c    |          | 
|-------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
| regB/inp[0]       |         | Rise |  0.2000 | 0.0000 |        |          |          |           |         |         |          |      |          | 
|-------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
| regB/i_0_2/A2     | AND2_X1 | Rise |  0.2000 | 0.0000 | 0.1000 |          | 0.97463  |           |         |         |          |      |          | 
|-------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
| regB/i_0_2/ZN     | AND2_X1 | Rise |  0.2450 | 0.0450 | 0.0080 | 0.260276 | 1.06234  | 1.32262   |         | 1       | 54.0402  |      |          | 
|-------------------+---------+------+---------+--------+--------+----------+----------+-----------+---------+---------+----------+------+----------|
| regB/out_reg[0]/D | DFF_X1  | Rise |  0.2450 | 0.0000 | 0.0080 |          | 1.14029  |           |         |         |          | F    |          | 
-----------------------------------------------------------------------------------------------------------------------------------------------------

---------------------------------------------------------------
|                                          | Time    | Total  | 
|------------------------------------------+---------+--------|
| target clock sysclk_new_mode (rise edge) |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock cycle shift                 |  0.0000 | 0.0000 | 
|------------------------------------------+---------+--------|
| target clock propagated network latency  |  0.0670 | 0.0670 | 
|------------------------------------------+---------+--------|
| library hold check                       |  0.0140 | 0.0810 | 
|------------------------------------------+---------+--------|
| data required time                       |  0.0810 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| data arrival time                        |  0.2450 |        | 
|------------------------------------------+---------+--------|
| data required time                       | -0.0810 |        | 
|------------------------------------------+---------+--------|
| pessimism                                |  0.0000 |        | 
|------------------------------------------+---------+--------|
|                                          |         |        | 
|------------------------------------------+---------+--------|
| slack                                    |  0.1640 |        | 
---------------------------------------------------------------

info UI33: performed report_timing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
Nitro-SoC> report_placement
Report 'placement': Placement Report
Generated on Sun Dec 4 17:31:29 2022
  
--------------------------------------------------------------------------
|   Placement Bounding Box Statistics [integrationMult] length units:    |
|                                angstrom                                |
|-----------+-------------+----------------+---------------+-------------|
| Pin Count | Average     | Number Of Nets | Total Length  | Deviation   | 
|-----------+-------------+----------------+---------------+-------------|
| All       | 52486.6920  | 526            | 27608000.0000 | 61016.2076  | 
|-----------+-------------+----------------+---------------+-------------|
| 2         | 27692.0782  | 243            | 6729175.0000  | 25601.0549  | 
|-----------+-------------+----------------+---------------+-------------|
| 3         | 44141.2857  | 175            | 7724725.0000  | 27724.3054  | 
|-----------+-------------+----------------+---------------+-------------|
| 4         | 69805.3846  | 65             | 4537350.0000  | 38543.7504  | 
|-----------+-------------+----------------+---------------+-------------|
| 5         | 156907.5000 | 10             | 1569075.0000  | 146889.0738 | 
|-----------+-------------+----------------+---------------+-------------|
| >=6       | 213565.9091 | 33             | 7047675.0000  | 84149.6256  | 
--------------------------------------------------------------------------

Pin Count Statistics, Min:  2
Pin Count Statistics, Max:  13
Pin Count Statistics, Avg:  3.10266
Pin Count Statistics, Sum:  1632
  
--------------------------------------------------
|           Placement Area Statistics            |
|--------------------------------------+---------|
|                                      | Value   | 
|--------------------------------------+---------|
| Total Instance count                 | 513     | 
|--------------------------------------+---------|
| Total Leaf-cells in the netlist      | 507     | 
|--------------------------------------+---------|
| Total Number of Buf+Inv              | 105     | 
|--------------------------------------+---------|
| Total Number of Macros               | 0       | 
|--------------------------------------+---------|
| Total Number of Pads                 | 0       | 
|--------------------------------------+---------|
| Total Utilized Area (sq micron)      | 601.16  | 
|--------------------------------------+---------|
| Total Macro+Pad Area (sq micron)     | 0       | 
|--------------------------------------+---------|
| Total Logic Area (sq micron)         | 601.16  | 
|--------------------------------------+---------|
| Total Physical-Only Area (sq micron) | 0       | 
|--------------------------------------+---------|
| Total Buf+Inv Area (sq micron)       | 55.86   | 
|--------------------------------------+---------|
| Total Placeable Row Area (sq micron) | 1058.41 | 
|--------------------------------------+---------|
| Logic Cell Utilization (%)           | 56.79   | 
|--------------------------------------+---------|
| Silicon Area Utilization (%)         | 49.13   | 
--------------------------------------------------

  
-----------------------------------------------------------------------------------------------------------
|                                      Cell and Row Site Statistics                                       |
|----------------------------------+-----------+------------+--------------+-------------+----------------|
| Site Name                        | Row Count | Site Count | Placed Cells | Fixed Cells | Unplaced Cells | 
|----------------------------------+-----------+------------+--------------+-------------+----------------|
| FreePDK45_38x28_10R_NP_162NW_34O | 23        | 3979       | 471          | 36          | 0              | 
-----------------------------------------------------------------------------------------------------------

  
Cell Density Map Utilization - 9 objects 
    --- get_objects cell_density_rect -of [get_objects cell_density_map] -fi --->
0   | 0
5   | 0
10  | 0
15  | 0
20  | 0
25  | 0
30  | 0
35  | 0
40  | 0
45  | 0
50  |==================== 2
55  |========================================================================= 7
60  | 0
65  | 0
70  | 0
75  | 0
80  | 0
85  | 0
90  | 0
95  | 0
100 | 0
105 | 0
110 | 0
115 | 0
120 | 0
125 | 0
130 | 0
135 | 0
140 | 0
145 | 0
150 |
    V      get_property -name utilization -object %object%
Nitro-SoC> write_db -file db/route.db

warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
Nitro-SoC> source flow_scripts/4_export.tcl


######################################################
#  Export Flow                                       #
# Version : 2019.1.R2                                #
#  Fix process antennas, add fillers & metal fill    #
#  Output design data.                               #
#  Control vars defined in flow_variables.tcl        #
#                                                    #
######################################################

Nitro-SoC> # config_shell -echo_script false
info UI33: performed source of flow_variables.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
info UI33: performed source of scr/kit_utils.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
Loading utility util::nrf_utils
  util::save_vars already loaded.  Use -force true to overwrite
Loading utility util::db_utils
NRF info: Checking flow variables for export
NRF info: Verifying user input for export
Storing TCL variables as db root property
info UI33: performed source of nrf_customization.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
Checking Antenna rules:
  OXIDE1:
metal1:
  No rules are defined
metal2:
  No rules are defined
metal3:
  No rules are defined
metal4:
  No rules are defined
metal5:
  No rules are defined
metal6:
  No rules are defined
metal7:
  No rules are defined
metal8:
  No rules are defined
metal9:
  No rules are defined
metal10:
  No rules are defined

Checking Antenna library:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
  All pins have Antenna area information

Antenna verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
Skip 35 nets with insufficient antenna information.

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_ant': Report Antenna
Generated on Sun Dec 4 17:31:48 2022
  
----------------------------------------------------------------------------------------------------
|                                   Antenna verification report                                    |
|-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
----------------------------------------------------------------------------------------------------

info UI33: performed Antenna verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Antenna fixing progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
Skip 35 nets with insufficient antenna information.

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Incremental timing update of 0 nets
Report 'report_ant': Report Antenna
Generated on Sun Dec 4 17:31:49 2022
  
----------------------------------------------------------------------------------------------------
|                                   Antenna verification report                                    |
|-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
----------------------------------------------------------------------------------------------------

info UI33: performed Antenna fixing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:31:49 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
NRF info: Placing filler cells using lib cells: FILLCELL_X8 FILLCELL_X4 FILLCELL_X32 FILLCELL_X2 FILLCELL_X16 FILLCELL_X1

warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
info Removing existing filler cells.
info UI49: removed 0 core filler cells
info UI49: inserted 567 core filler cells
info DUM207: place_filler_cells: re-initialized cell-density map for partition integrationMult old bin-size 8x8 rows new bin-size 8x8 rows.
info DUM204: place_filler_cells: re-initialized cell-density map for partition integrationMult old max-util 100 new max-util 100.
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
info UI33: performed core filler cells placement for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
NRF info: Checking for unfilled gaps after filler cell insertion
info UI49: Found 0 unfilled gaps (0 minimum sites).
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
info UI33: performed check_unfilled_gaps for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:31:49 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 2     | 2      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 1     | 1      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
NRF info: Number of DRC errors increased after filler cell insertion (3 > 0). Running DRC clean-up 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
DRC cleaning progress:
Iteration  0 on  metal1 layer (     4 wins): 20% 50% 70% 100% 
Iteration  0 on  metal2 layer (     1 wins): 100% 
Iteration  0 on  metal3 layer (     4 wins): 20% 50% 70% 100% 
Iteration  0 on  metal4 layer (     1 wins): 100% 
Iteration  0 on  metal5 layer (     1 wins): 100% 
Iteration  0 on  metal6 layer (     1 wins): 100% 
Iteration  0 on  metal7 layer (     1 wins): 100% 
Iteration  0 on  metal8 layer (     1 wins): 100% 
Iteration  0 on  metal9 layer (     1 wins): 100% 
Iteration  0 on metal10 layer (     1 wins): 100% 
Iteration  1 on  metal1 layer (     1 wins): 100% 

--------------------------------------------------------------------------------------------------------------------
|                                               DRC cleaning report                                                |
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|               | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Removed vias  | 3     | 3      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Removed wires | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Clipped wires | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|---------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Modified nets | 3     | 3      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
--------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M)
warning UI1291: The size of '-column_names' does not equal to the number of columns in '-values' arg.
---------------------------------
|  Start run_route_timing flow  |
|-----------------+-------------|
| Argument        | Value       | 
|-----------------+-------------|
| cpus            | 2           | 
|-----------------+-------------|
| messages        | default     | 
|-----------------+-------------|
| timing_mode     | si          | 
|-----------------+-------------|
| preserve_clocks | auto        | 
|-----------------+-------------|
| save_db_stages  |             | 
|-----------------+-------------|
| stop_after      | false       | 
|-----------------+-------------|
| start_from      | false       | 
|-----------------+-------------|
| resume          | false       | 
|-----------------+-------------|
| skip_stages     |             | 
|-----------------+-------------|
| run_stages      |             | 
|-----------------+-------------|
| mode            | repair      | 
|-----------------+-------------|
| trial           | false       | 
|-----------------+-------------|
| dump_qor_stages |             | 
|-----------------+-------------|
| user_params     | -drc_effort | 
---------------------------------

NRF info: Setting up run_route_timing flow ...

warning UI4: Only 1 cores are available; the -cpus argument was set to 2.
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
info UI33: performed update timing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
Routing lib vias have been created
Routing lib vias have been selected
info UI30: performing congestion analysis on partition integrationMult (started at Sun Dec 4 17:31:49 2022)

Congestion ratio stats: min = 0.06, max = 0.45, mean = 0.29 
At threshold 1.17, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)
At threshold 0.99, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)
At threshold 0.87, found 0 hot spots, consisting of 0 grid-cells (0.00 pct of total)

-------------------------------------------------
| Grade = A; the partition should route easily. |
-------------------------------------------------

info UI33: performed congestion analysis for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
|                                                                           Current Parameter Values for 'config_route_timing'                                                                            |
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| Name                     | Description                                                     | Value      | Default    | Modified | Value_type | Enum                           | Persistent | User_level | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| dvia_mode                | Specifies the mode of double via replacement                    | dfm        | timing     | true     | N/A        | dfm none timing                | true       | normal     | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_gr_channel   | Specifies effort to preserve channel for follow_gr nets in      | 90         | 0          | true     | N/A        |                                | true       | advanced   | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_gr_layer     | Specifies effort to preserve layer for follow_gr nets in        | 100        | 0          | true     | N/A        |                                | true       | advanced   | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| ds_max_count             | Specifies the maximum allowed number of dominant scenarios      | 6          | 0          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| ds_threshold             | Specifies the percentage threshold for dominant scenarios       | 80         | 0          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| fr_topo_cri_priority     | Specifies priority value for topology critical nets in          | 0          | 50         | true     | N/A        |                                | true       | developer  | 
|                          | route_final (0-100)                                             |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| low_power_effort         | Specifies low power effort                                      | low        | none       | true     | N/A        | high low medium none           | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| opt_cdm_model            | Specifies advanced CDM model                                    | delta_area | delta_area | true     | N/A        | delta_area dynamic_bloat none  | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| opt_cpus                 | Specifies number of cpus for optimizer ('0' - distributed)      | 4          | 4          | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| si_mcmm                  | Specifies to look at all the enabled corners in si_delay_repair | true       | false      | true     | N/A        |                                | true       | developer  | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_dont_route_clocks     | Specifies to prohibit route_track from touching existing clock  | false      | true       | true     | N/A        |                                | true       | developer  | 
|                          | routing                                                         |            |            |          |            |                                |            |            | 
|--------------------------+-----------------------------------------------------------------+------------+------------+----------+------------+--------------------------------+------------+------------|
| tr_preserve_all_gr_layer | Specifies effort to preserve layer for all the nets in          | 100        | 0          | true     | N/A        |                                | true       | developer  | 
|                          | route_track (0-100)                                             |            |            |          |            |                                |            |            | 
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


RRT info: Running run_route_timing in 'repair' mode ...

RRT info: Start stage 'check'
RRT info: User event handler 'before check' completed successfully
-----------------------------
|  Check routing lib vias   |
|-------+---------+---------|
| layer | regular | minarea | 
|-------+---------+---------|
| via1  | ok      | none    | 
|-------+---------+---------|
| via2  | ok      | none    | 
|-------+---------+---------|
| via3  | ok      | none    | 
|-------+---------+---------|
| via4  | ok      | none    | 
|-------+---------+---------|
| via5  | ok      | none    | 
|-------+---------+---------|
| via6  | ok      | none    | 
|-------+---------+---------|
| via7  | ok      | none    | 
-----------------------------

RRT info: Stage 'check' completed successfully
RRT info: User event handler 'after check' completed successfully
RRT info: Start stage 'open'
RRT info: User event handler 'before open' completed successfully
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:31:49 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 3         | 3    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

  
-----------------------------------------------
| LVS open distance distribution (nanometers) |
|--------+-------+----------------------------|
|        | Total | 0.00                       | 
|--------+-------+----------------------------|
| % open | 100   | 100.00                     | 
|--------+-------+----------------------------|
| # open | 3     | 3                          | 
-----------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
LVS cleaning progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:31:50 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:31:50 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 3         | 3    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

  
-----------------------------------------------
| LVS open distance distribution (nanometers) |
|--------+-------+----------------------------|
|        | Total | 0.00                       | 
|--------+-------+----------------------------|
| % open | 100   | 100.00                     | 
|--------+-------+----------------------------|
| # open | 3     | 3                          | 
-----------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:31:50 2022)
Start Final Routing in simple DRC mode on 1 cpus

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1632 | 
|-------------------+------+------|
| To be routed :    | 526  | 1632 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 0    | 0    | 
|-------------------+------+------|
| To be skipped :   | 2    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 2    | 0    | 
-----------------------------------

Check opens ...
Longest open in net 'regA/out[2]' of length=0
Total opens=3 (nets=3)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G

Run(1) 'Objective: fix opens'   ...
Result=end(begin): opens=0(3), viols=0(0)
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G

Finish Final Routing ...
Number of touched nets: 3
Number of changed nets: 3

info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
LVS cleaning progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:31:50 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | -         | -    | 0     | 0    | -    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS cleaning for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:31:50 2022)
Start Final Routing in simple DRC mode on 1 cpus
  with 'number' acceptance 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1632 | 
|-------------------+------+------|
| To be routed :    | 526  | 1632 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 0    | 0    | 
|-------------------+------+------|
| To be skipped :   | 2    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 2    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
LVS verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
Report 'report_lvs': Detail Routing LVS Report
Generated on Sun Dec 4 17:31:50 2022
  
----------------------------------------------------------------------------------------------
|                           LVS detail routing verification report                           |
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
|                   | Total nets | Open nets | Open | Float | Tail | Loop | Pillar | Warning | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Signal nets       | 526        | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Logic nets        | 2          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Shield nets       | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| Power/Ground nets | -          | -         | -    | -     | -    | -    | -      | -       | 
|-------------------+------------+-----------+------+-------+------+------+--------+---------|
| DontRoute nets    | 0          | 0         | 0    | 0     | 0    | 0    | -      | -       | 
----------------------------------------------------------------------------------------------

info UI33: performed LVS verification for 0 sec (CPU time: 0 sec; MEM: RSS - 282M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
RRT info: Stage 'open' completed successfully
RRT info: User event handler 'after open' completed successfully
RRT info: Start stage 'drc'
RRT info: User event handler 'before drc' completed successfully
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT warning: User-specified value 'high' for option 'drc_effort' overrides previous ''
RRT warning: User-specified value 'number' for option 'drc_accept' overrides previous ''
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:31:50 2022)
Start Final Routing in full DRC mode on 1 cpus
  with 'number' acceptance 
  with expensive effort

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1632 | 
|-------------------+------+------|
| To be routed :    | 526  | 1632 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 0    | 0    | 
|-------------------+------+------|
| To be skipped :   | 2    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 2    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Report 'tdro_drc': Report Drc
Generated on Sun Dec 4 17:31:50 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)

RRT info: Number of remaining shorts: 0
RRT info: Number of remaining DRCs  : 0

Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT info: Stage 'drc' completed successfully
RRT info: User event handler 'after drc' completed successfully
RRT info: Start stage 'dp'
RRT info: User event handler 'before dp' completed successfully
RRT info: Stage 'dp' skipped
RRT info: Start stage 'dvia'
RRT info: User event handler 'before dvia' completed successfully
RRT warning: Configured value 'dfm' for option 'dvia_mode' overrides previous 'timing'
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
DFM via replacement progress:
Processing via1: 30% 60% 100% 
Processing via2: 50% 100% 
Processing via3: 30% 60% 100% 
Processing via4: 50% 100% 
Processing via5: 50% 100% 
Processing via6: 50% 100% 
Processing via7: 100% 

Incremental timing update of 3 nets

Report 'report_dfm_rvi': DFM via replacement report
Generated on Sun Dec 4 17:31:51 2022
  
--------------------------------------------------------------------------------------------
|                                DFM via replacement report                                |
|-------------------+-------+------+------+------+------+------+------+------+------+------|
|                   | Total | via1 | via2 | via3 | via4 | via5 | via6 | via7 | via8 | via9 | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Checked vias      | 3866  | 1610 | 2005 | 245  | 6    | 0    | 0    | 0    | 0    | 0    | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Replaced vias     | 3     | 3    | 0    | 0    | 0    | 0    | 0    | 0    | 0    | 0    | 
|-------------------+-------+------+------+------+------+------+------+------+------+------|
| Replaced vias (%) | 0.08  | 0.19 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
--------------------------------------------------------------------------------------------

-----------------------------------------------------------------------------------------------------------
|                                      Via statistics in the design                                       |
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
|                            | TOTAL  | via1  | via2  | via3  | via4   | via5 | via6 | via7 | via8 | via9 | 
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
| Number of vias  (thousand) | 3.87   | 1.61  | 2.01  | 0.24  | 0.01   | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
| Vias (%)                   | 100.00 | 41.58 | 51.94 | 6.33  | 0.15   | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 | 
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
| Single vias (%)            | 14.57  | 14.91 | 15.51 | 4.90  | 0.00   | 0    | 0    | 0    | 0    | 0    | 
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
| Double vias (%)            | 85.43  | 85.09 | 84.49 | 95.10 | 100.00 | 0    | 0    | 0    | 0    | 0    | 
|----------------------------+--------+-------+-------+-------+--------+------+------+------+------+------|
| Multi vias (%)             | 0.00   | 0.00  | 0.00  | 0.00  | 0.00   | 0    | 0    | 0    | 0    | 0    | 
-----------------------------------------------------------------------------------------------------------

info UI33: performed Via replacement for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT warning: User-specified value 'high' for option 'drc_effort' overrides previous ''
RRT warning: User-specified value 'number' for option 'drc_accept' overrides previous ''
RRT warning: User-specified value 'number_improved' for option 'drc_accept' overrides previous 'number'
info UI30: performing final routing on partition integrationMult (started at Sun Dec 4 17:31:51 2022)
Start Final Routing in full DRC mode on 1 cpus
  with 'number' acceptance 
  with expensive effort

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
-----------------------------------
|         Nets statistics         |
|-------------------+------+------|
|                   | Nets | Pins | 
|-------------------+------+------|
| Total (partition) | 528  | 1632 | 
|-------------------+------+------|
| To be routed :    | 526  | 1632 | 
|-------------------+------+------|
|   - signal        | 526  | 1632 | 
|-------------------+------+------|
|   - tieoff        | 0    | 0    | 
|-------------------+------+------|
| To be skipped :   | 2    | 0    | 
|-------------------+------+------|
|   - less 2 pins   | 2    | 0    | 
-----------------------------------

Check opens ...
Total opens=0 (nets=0)

Check routing ...

Initialization finished
Cpu time: 00:00:00, Elapsed time: 00:00:01, Memory: 2.8G


Check violations (1 windows)...
Total viols=0
Cpu time: 00:00:00, Elapsed time: 00:00:00, Memory: 2.8G

Finish Final Routing ...
info UI33: performed final routing for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Report 'tdro_drc': Report Drc
Generated on Sun Dec 4 17:31:51 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M, PRSS - 242M)

RRT info: Number of remaining shorts: 0
RRT info: Number of remaining DRCs  : 0

Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
RRT info: Stage 'dvia' completed successfully
RRT info: User event handler 'after dvia' completed successfully
Identifying nets for shielding ...
warning   NO nets specified have shield rule

RRT info: Set 'is_dont_route' and 'is_dont_modify' properties of '5' clock nets to 'false'
Nitro-SoC> # config_shell -ignore_errors false
Nitro-SoC> # config_application -cpus 1
Nitro-SoC> # config_timing -cpus 2
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
Nitro-SoC> # config_default_value -command route_global -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_global -argument messages -value normal
Nitro-SoC> # config_default_value -command route_track -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_track -argument messages -value normal
Nitro-SoC> # config_default_value -command route_final -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_final -argument messages -value normal
Nitro-SoC> # config_default_value -command route_si_repair -argument check -value  
Nitro-SoC> # config_default_value -command route_si_repair -argument messages -value normal
Nitro-SoC> # config_route_final -opt_strict_drc false
Nitro-SoC> # fk_msg -set_prompt NRF
Nitro-SoC> # new_config_flow -name flow_msg_prompt -quiet
Nitro-SoC> # new_config_flow -name flow_msg_prompt -value NRF -descr Flow prefix - will appear in all messages printed by flow_msg -quiet
Nitro-SoC> # config_shell -level normal
Nitro-SoC> # fk_msg -set_verbosity_filter info
Nitro-SoC> # new_config_flow -name verbose_level
Nitro-SoC> # new_config_flow -name verbose_level -value info -quiet
Nitro-SoC> # config_shell -echo false
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
Nitro-SoC> # config_shell -ignore_errors false
Nitro-SoC> # config_application -cpus 1
Nitro-SoC> # config_timing -cpus 2
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
Nitro-SoC> # config_default_value -command route_global -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_global -argument messages -value normal
Nitro-SoC> # config_default_value -command route_track -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_track -argument messages -value normal
Nitro-SoC> # config_default_value -command route_final -argument check -value  technology libraries routing 
Nitro-SoC> # config_default_value -command route_final -argument messages -value normal
Nitro-SoC> # config_default_value -command route_si_repair -argument check -value  
Nitro-SoC> # config_default_value -command route_si_repair -argument messages -value normal
Nitro-SoC> # config_route_final -opt_strict_drc false
Nitro-SoC> # fk_msg -set_prompt NRF
Nitro-SoC> # new_config_flow -name flow_msg_prompt -quiet
Nitro-SoC> # new_config_flow -name flow_msg_prompt -value NRF -descr Flow prefix - will appear in all messages printed by flow_msg -quiet
Nitro-SoC> # config_shell -level normal
Nitro-SoC> # fk_msg -set_verbosity_filter info
Nitro-SoC> # new_config_flow -name verbose_level
Nitro-SoC> # new_config_flow -name verbose_level -value info -quiet
Nitro-SoC> # config_shell -echo false
warning The design is already timed. New CPU settings will be effective from next non-incremental timing analysis
info DRC201: Only violations caused by detail_route shapes are being checked.
DRC verification progress:
Processing metal1: 50% 100% 
Processing metal2: 100% 
Processing metal3: 50% 100% 
Processing metal4: 100% 
Processing metal5: 100% 
Processing metal6: 100% 
Processing metal7: 100% 
Processing metal8: 100% 
Processing metal9: 100% 
Processing metal10: 100% 
Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.

Report 'report_drc': Report Drc
Generated on Sun Dec 4 17:31:51 2022
  
----------------------------------------------------------------------------------------------------------------------------
|                                                 DRC verification report                                                  |
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | metal1 | metal2 | metal3 | metal4 | metal5 | metal6 | metal7 | metal8 | metal9 | metal10 | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Width                 | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum samenet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat samenet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum diffnet space | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Fat diffnet space     | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Diffnet short         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Prohibited routing    | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
|                       | TOTAL | CO     | via1   | via2   | via3   | via4   | via5   | via6   | via7   | via8   | via9    | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Grid                  | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Size                  | 0     | -      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
|-----------------------+-------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------|
| Minimum space         | 0     | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0      | 0       | 
----------------------------------------------------------------------------------------------------------------------------

info UI33: performed DRC verification for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M)
info UI34: no objects were found for '*'
info UI36: Writing Verilog file 'output/integrationMult.v.gz'.
info UI33: performed verilog write for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M)
info UI36: Writing DEF file 'output/integrationMult.def.gz'.
info UI33: performed DEF write for 0 sec (CPU time: 0 sec; MEM: RSS - 281M, CVMEM - 2788M, PVMEM - 2819M)
Annotate antenna information on 35 pins from 35 nets
Antenna verification progress:
Preparing nets ...
Processing nets: 10% 20% 30% 40% 50% 60% 70% 80% 90% 100% 
NRF warning: No GDS layer-map file specified in flow variable MGC_gds_layer_map_file.  GDS will not be written
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file 'flow_scripts/4_export.tcl' execution failed (and stopped) at line 346 (write_db -data design -file dbs/export.db).
Nitro-SoC> check_design 
info CHK10: Checking technology...
info CHK10: Checking libraries...
info CHK10: Checking design...
info CHK10: Checking partition...
info CHK10: Checking cells...
info CHK10: Checking nets...
info CHK10: Checking pins...
info CHK10: Checking placement...
info DP158: Found 567 filler cells in partition integrationMult and they will be treated as fixed. You might want to remove them before doing detail placement.
info Found 471 movable and 603 fixed cells in partition integrationMult
info DP136: Found 0 moveable cells and 0 fixed cells to be illegal.
info CHK10: Checking floorplan...
------------------------------------------------------------------------------------------------------------
|                                            Technology Errors                                             |
|----------------------+-------+---------+-----------------------------------------------------------------|
| Name                 | Count | Status  | Description                                                     | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| no_parasitics        | 0     | Passed  | Layer has no corresponding parasitics data                      | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| no_ndr_vias          | 0     | Passed  | No vias at all in non default rule.                             | 
|                      |       |         | Use default vias                                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| partial_ndr_vias     | 1     | Warning | Not all layers have vias in non default rule.                   | 
|                      |       |         | Use default vias                                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| duplicate_lvias      | 0     | Passed  | Duplicate name for some lib_vias in non default rule.           | 
|                      |       |         | To avoid unpredictable results please fix the problem by        | 
|                      |       |         | keeping unique names.                                           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_width      | 0     | Passed  | Nondefault rule width is less then default width on the         | 
|                      |       |         | layer                                                           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_space      | 0     | Passed  | Nondefault rule spacing is less then required spacing on        | 
|                      |       |         | the layer                                                       | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_min_layer  | 0     | Passed  | Nondefault rule min layer is higher than partition max layer    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_ndr_max_layer  | 0     | Passed  | Nondefault rule max layer is higher than partition max layer    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| ndr_duplicated       | 0     | Passed  | Nondefault rule has duplication in different libraries          | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_min_area       | 0     | Passed  | Min area requirement is too big                                 | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_hole_area      | 0     | Passed  | Hole area requirement is too big                                | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_mfgrid         | 0     | Passed  | Manufacturing grid is too big                                   | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| not_even_mfgrid      | 0     | Passed  | All width and spacing rules on all metal and cut layers must be | 
|                      |       |         | an even multiple of manufacturing grid (2*N*mg)                 | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_layer_dir      | 0     | Passed  | Direction of the layer is not reversed to below layer           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_layer_order    | 0     | Passed  | Order of layer is wrong, should be metal-cut-metal-...-metal    | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_m1_width       | 0     | Passed  | Width of M1 pins is less then minimum width parameter           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_cut_size       | 0     | Passed  | Size of cut is not defined and can't be determined              | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_cut_space      | 0     | Passed  | Space between cuts is not defined and can't be determined       | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_diff_cut_space | 0     | Passed  | Diffnet cut spacing is less then samenet cut spacing            | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| wrong_proj_cut_space | 0     | Passed  | Projection cut spacing is less to diffnet cut spacing           | 
|----------------------+-------+---------+-----------------------------------------------------------------|
| max_metal            | 0     | Passed  | Top metal is too wide for routing                               | 
------------------------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
|                                       Pin Errors                                        |
|----------------------+-------+---------+------------------------------------------------|
| Name                 | Count | Status  | Description                                    | 
|----------------------+-------+---------+------------------------------------------------|
| not_connected        | 32    | Warning | Pin is not connected to any net                | 
|----------------------+-------+---------+------------------------------------------------|
| pg_not_connected     | 0     | Passed  | PG core pin is not connected to any supply net | 
|----------------------+-------+---------+------------------------------------------------|
| no_leaf_pin_geometry | 4     | Warning | Leaf pin doesn't have geometry or not placed.  | 
-------------------------------------------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------
|                                               Floorplan Errors                                                |
|---------------------------+-------+---------+-----------------------------------------------------------------|
| Name                      | Count | Status  | Description                                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_tracks                 | 0     | Passed  | No preferred direction routing tracks on the layer.             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| track_step_too_small      | 0     | Passed  | Step of routing tracks is smaller then via-wire spacing.        | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| track_step_too_big        | 0     | Passed  | Step of routing tracks is bigger then via-wire spacing.         | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| diff_track_step           | 0     | Passed  | Different step of preferred direction routing tracks.           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_not_cover_pin      | 0     | Passed  | Routing tracks do not cover pin.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_not_masked         | 0     | Passed  | Routing tracks shall have mask on masked layer.                 | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| tracks_incorrectly_masked | 0     | Passed  | Routing tracks masks shall interlace.                           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_macro_pin_access       | 0     | Passed  | Macro pin doesn't have routing access.                          | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| macro_pin_blocked         | 0     | Passed  | Macro pin may be blocked by nearby objects.                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_port_access            | 0     | Passed  | Partition port doesn't have routing access.                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| not_aligned_pin           | 0     | Passed  | Macro/top pin is not aligned to manufacturing grid.             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| offgrid_core_access       | 0     | Passed  | Library core pin has only offgird routing access.               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_core_access            | 0     | Passed  | Library core pin doesn't have routing access.                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_port_geometry          | 0     | Passed  | Port doesn't have geometry or not placed.                       | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_outside_partition    | 0     | Passed  | Port is placed outside partition.                               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_min_area             | 0     | Passed  | Port has insufficient minimum area.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_short                | 0     | Passed  | Port has intersection with other one.                           | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_spacing              | 0     | Passed  | Port has insufficient spacing with other one.                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| port_above_max_layer      | 0     | Passed  | Port is above of max layer.                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_overlaps           | 0     | Passed  | Region overlaps other region.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| cell_outside_region       | 0     | Passed  | Cell outside of region with member_hard requirement. Will       | 
|                           |       |         | cause pin assignment to fail.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| cell_inside_region        | 0     | Passed  | Foreign cell is inside region with non_member_hard requirement. | 
|                           |       |         | Will cause pin assignment to fail                               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_off_mfg_grid       | 0     | Passed  | Region is not on manufacturing grid                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| region_off_fp_grid        | 0     | Passed  | Region is not on floorplan grid.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| excessive_region_blockage | 0     | Passed  | Placement blockages cover more than 70% of region. Run          | 
|                           |       |         | report_region_utilization to verify placeability.               | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| macro_off_mfg             | 0     | Passed  | Macro off manufacturing grid.                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| missing_cell_rows         | 0     | Passed  | No cell rows are found in the design. Placer will fail          | 
|                           |       |         | without rows.                                                   | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| partition_overlap         | 0     | Passed  | Partition overlaps other partition.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| partition_off_fp_grid     | 0     | Passed  | Partition is not on floorplan grid.                             | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| endcap_alignment          | 0     | Passed  | Cell is not aligned with the cell row.                          | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| row_without_endcaps       | 46    | Warning | Row has no endcap cells at ends.                                | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| no_pin_mask               | 0     | Passed  | Port shape does not have a mask on a masked layer.              | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| narrow_pin_misalignment   | 0     | Passed  | Narrow port shape mask, on masked layer, doesn't match          | 
|                           |       |         | track mask.                                                     | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| wide_pin_misalignment     | 0     | Passed  | Wide port shape mask, on masked layer, should be on alternate   | 
|                           |       |         | mask to reduce routing congestion.                              | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| short_placement_width     | 0     | Passed  | The width of the placement rectangle is short.                  | 
|---------------------------+-------+---------+-----------------------------------------------------------------|
| object_off_floorplan_grid | 0     | Passed  | Objects are off floorplan grid.                                 | 
-----------------------------------------------------------------------------------------------------------------

Nitro-SoC> config_report_timing -path_type full_data
Nitro-SoC> x_get_timing_path -modes { new_mode } -corners { corner_0_0 } -rise true -fall true -max_delay true -min_delay false -max_paths 50 -group "I2O I2R R2O"
error TA_CMDS7437: At most one of -rise and -fall options can be specified at the same time.
info UI33: performed design checks for 0 sec (CPU time: 0 sec; MEM: RSS - 283M, CVMEM - 2788M, PVMEM - 2819M)
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 1 (write_db -file db/final.db).
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 1 (write_db -file db/final.db).
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 1 (write_db -file db/final.db).
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 142500a -yb_area 21000a -xr_area 142500a -yt_area 63000a -filter "@net_name == n_2 && @length == 42000.0000 && @width == 0.0000 && @layer == metal2 && @orientation == vertical && @route_type == global_route"] -keep false
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area 75843a -xr_area 367080a -yt_area 460803a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area 169166a -xr_area 367080a -yt_area 554126a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area 262489a -xr_area 367080a -yt_area 647449a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area 169166a -xr_area 367080a -yt_area 554126a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area 75843a -xr_area 367080a -yt_area 460803a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area -17480a -xr_area 367080a -yt_area 367480a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area -110803a -xr_area 367080a -yt_area 274157a
Nitro-SoC> zoom_to -target area -xl_area -17480a -yb_area -204126a -xr_area 367080a -yt_area 180834a
Nitro-SoC> zoom_to -target area -xl_area 14754a -yb_area -148520a -xr_area 322402a -yt_area 159447a
Nitro-SoC> zoom_to -target area -xl_area 40541a -yb_area -104035a -xr_area 286659a -yt_area 142337a
Nitro-SoC> zoom_to -target area -xl_area 61171a -yb_area -68447a -xr_area 258065a -yt_area 128649a
Nitro-SoC> zoom_to -target area -xl_area 77675a -yb_area -39977a -xr_area 235189a -yt_area 117698a
Nitro-SoC> zoom_to -target area -xl_area 105967a -yb_area 8827a -xr_area 195975a -yt_area 98927a
Nitro-SoC> zoom_to -target area -xl_area 113511a -yb_area 21841a -xr_area 185517a -yt_area 93921a
Nitro-SoC> zoom_to -target area -xl_area 119721a -yb_area 28321a -xr_area 177325a -yt_area 85984a
Nitro-SoC> zoom_to -target area -xl_area 128001a -yb_area 36960a -xr_area 166403a -yt_area 75402a
Nitro-SoC> zoom_to -target area -xl_area 131313a -yb_area 40416a -xr_area 162034a -yt_area 71169a
Nitro-SoC> zoom_to -target area -xl_area 135728a -yb_area 45023a -xr_area 156208a -yt_area 65525a
Nitro-SoC> zoom_to -target area -xl_area 137494a -yb_area 46866a -xr_area 153878a -yt_area 63267a
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 2000a -yb_area 58500a -xr_area 347600a -yt_area 59900a -filter "@net_name == VDD && @length == 345600.0000 && @width == 1400.0000 && @layer == metal6 && @orientation == horizontal && @route_type == pre_route"] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type cell -xl_area 137300a -yb_area 52000a -xr_area 169600a -yt_area 66000a -filter {@name == out_reg[2] && @xorigin == 137300 && @yorigin == 52000}] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 145500a -yb_area 45350a -xr_area 146200a -yt_area 60050a -filter "@net_name == n_4 && @length == 14700.0000 && @width == 700.0000 && @layer == metal2 && @orientation == vertical && @route_type == detail_route"] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 120800a -yb_area 59350a -xr_area 151900a -yt_area 60050a -filter "@net_name == n_0 && @length == 31100.0000 && @width == 700.0000 && @layer == metal3 && @orientation == horizontal && @route_type == detail_route"] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type cell -xl_area 137300a -yb_area 52000a -xr_area 169600a -yt_area 66000a -filter {@name == out_reg[2] && @xorigin == 137300 && @yorigin == 52000}] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 145500a -yb_area 45350a -xr_area 146200a -yt_area 60050a -filter "@net_name == n_4 && @length == 14700.0000 && @width == 700.0000 && @layer == metal2 && @orientation == vertical && @route_type == detail_route"] -keep false
Nitro-SoC> select_objects -objects [get_area_objects -type wire -xl_area 151200a -yb_area 31350a -xr_area 151900a -yt_area 60050a -filter "@net_name == n_0 && @length == 28700.0000 && @width == 700.0000 && @layer == metal2 && @orientation == vertical && @route_type == detail_route"] -keep false
Nitro-SoC> zoom_to -target area -xl_area 140279a -yb_area 48897a -xr_area 153385a -yt_area 62017a
Nitro-SoC> zoom_to -target area -xl_area 142507a -yb_area 50522a -xr_area 152991a -yt_area 61017a
Nitro-SoC> zoom_to -target area -xl_area 140280a -yb_area 48897a -xr_area 153384a -yt_area 62015a
Nitro-SoC> zoom_to -target area -xl_area 123576a -yb_area 36714a -xr_area 156336a -yt_area 69509a
Nitro-SoC> zoom_to -target area -xl_area 116616a -yb_area 31637a -xr_area 157565a -yt_area 72630a
Nitro-SoC> zoom_to -target area -xl_area 107915a -yb_area 25291a -xr_area 159101a -yt_area 76532a
Nitro-SoC> zoom_to -target area -xl_area 42663a -yb_area -22299a -xr_area 170628a -yt_area 105802a
Nitro-SoC> zoom_to -target area -xl_area 15474a -yb_area -42128a -xr_area 175430a -yt_area 117997a
Nitro-SoC> zoom_to -target area -xl_area -18511a -yb_area -66914a -xr_area 181433a -yt_area 133241a
Nitro-SoC> zoom_to -target area -xl_area -273398a -yb_area -252814a -xr_area 226461a -yt_area 247572a
Nitro-SoC> zoom_to -target area -xl_area -267333a -yb_area -250851a -xr_area 232526a -yt_area 249535a
Nitro-SoC> zoom_to -target area -xl_area -246105a -yb_area -248829a -xr_area 253754a -yt_area 251557a
Nitro-SoC> zoom_to -target area -xl_area -202638a -yb_area -246807a -xr_area 297221a -yt_area 253579a
Nitro-SoC> zoom_to -target area -xl_area -146029a -yb_area -244786a -xr_area 353830a -yt_area 255600a
Nitro-SoC> zoom_to -target area -xl_area -90431a -yb_area -242764a -xr_area 409428a -yt_area 257622a
Nitro-SoC> zoom_to -target area -xl_area -64856a -yb_area -240742a -xr_area 435003a -yt_area 259644a
Nitro-SoC> zoom_to -target area -xl_area -63845a -yb_area -238720a -xr_area 436014a -yt_area 261666a
Nitro-SoC> zoom_to -target area -xl_area -58791a -yb_area -236699a -xr_area 441068a -yt_area 263687a
Nitro-SoC> zoom_to -target area -xl_area -52726a -yb_area -234677a -xr_area 447133a -yt_area 265709a
Nitro-SoC> zoom_to -target area -xl_area -42617a -yb_area -232655a -xr_area 457242a -yt_area 267731a
Nitro-SoC> zoom_to -target area -xl_area -40595a -yb_area -230633a -xr_area 459264a -yt_area 269753a
Nitro-SoC> zoom_to -target area -xl_area -36552a -yb_area -228612a -xr_area 463307a -yt_area 271774a
Nitro-SoC> zoom_to -target area -xl_area -35541a -yb_area -226590a -xr_area 464318a -yt_area 273796a
Nitro-SoC> zoom_to -target area -xl_area -39583a -yb_area -224568a -xr_area 460276a -yt_area 275818a
Nitro-SoC> zoom_to -target area -xl_area -40594a -yb_area -222546a -xr_area 459265a -yt_area 277840a
Nitro-SoC> zoom_to -target area -xl_area -41605a -yb_area -220525a -xr_area 458254a -yt_area 279861a
Nitro-SoC> zoom_to -target area -xl_area -44638a -yb_area -218503a -xr_area 455221a -yt_area 281883a
Nitro-SoC> zoom_to -target area -xl_area -45648a -yb_area -216481a -xr_area 454211a -yt_area 283905a
Nitro-SoC> zoom_to -target area -xl_area -50703a -yb_area -214459a -xr_area 449156a -yt_area 285927a
Nitro-SoC> zoom_to -target area -xl_area -52725a -yb_area -212437a -xr_area 447134a -yt_area 287949a
Nitro-SoC> zoom_to -target area -xl_area -58790a -yb_area -210416a -xr_area 441069a -yt_area 289970a
Nitro-SoC> zoom_to -target area -xl_area -62833a -yb_area -208394a -xr_area 437026a -yt_area 291992a
Nitro-SoC> zoom_to -target area -xl_area -68899a -yb_area -206372a -xr_area 430960a -yt_area 294014a
Nitro-SoC> zoom_to -target area -xl_area -71931a -yb_area -204350a -xr_area 427928a -yt_area 296036a
Nitro-SoC> zoom_to -target area -xl_area -73953a -yb_area -202329a -xr_area 425906a -yt_area 298057a
Nitro-SoC> zoom_to -target area -xl_area -75975a -yb_area -200307a -xr_area 423884a -yt_area 300079a
Nitro-SoC> zoom_to -target area -xl_area -74965a -yb_area -198285a -xr_area 424894a -yt_area 302101a
Nitro-SoC> zoom_to -target area -xl_area -74965a -yb_area -196263a -xr_area 424894a -yt_area 304123a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -194242a -xr_area 378394a -yt_area 306144a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -190198a -xr_area 378394a -yt_area 310188a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -176046a -xr_area 378394a -yt_area 324340a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -154817a -xr_area 378394a -yt_area 345569a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -136621a -xr_area 378394a -yt_area 363765a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -122469a -xr_area 378394a -yt_area 377917a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -100230a -xr_area 378394a -yt_area 400156a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -88099a -xr_area 378394a -yt_area 412287a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -80012a -xr_area 378394a -yt_area 420374a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -76979a -xr_area 378394a -yt_area 423407a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -72936a -xr_area 378394a -yt_area 427450a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -66871a -xr_area 378394a -yt_area 433515a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -68891a -xr_area 378394a -yt_area 431495a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -71924a -xr_area 378394a -yt_area 428462a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -72935a -xr_area 378394a -yt_area 427451a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -75968a -xr_area 378394a -yt_area 424418a
Nitro-SoC> zoom_to -target area -xl_area -121465a -yb_area -76978a -xr_area 378394a -yt_area 423408a
Nitro-SoC> zoom_to -target area -xl_area -230194a -yb_area -147612a -xr_area 394628a -yt_area 477868a
Nitro-SoC> zoom_to -target area -xl_area -121463a -yb_area -76976a -xr_area 378393a -yt_area 423406a
Nitro-SoC> zoom_to -target area -xl_area -34478a -yb_area -20467a -xr_area 365405a -yt_area 379837a
Nitro-SoC> zoom_to -target area -xl_area 35108a -yb_area 24739a -xr_area 355014a -yt_area 344982a
Nitro-SoC> zoom_to -target area -xl_area 90777a -yb_area 60904a -xr_area 346701a -yt_area 317097a
Nitro-SoC> zoom_to -target area -xl_area 135312a -yb_area 89835a -xr_area 340051a -yt_area 294789a
Nitro-SoC> zoom_to -target area -xl_area 194692a -yb_area 128410a -xr_area 331184a -yt_area 265046a
Nitro-SoC> zoom_to -target area -xl_area 218444a -yb_area 143840a -xr_area 327637a -yt_area 253148a
Nitro-SoC> zoom_to -target area -xl_area 259161a -yb_area 170291a -xr_area 321557a -yt_area 232752a
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 1 (write_db -file db/final.db).
Nitro-SoC> source ../save_design.sh
warning UI4: Only 1 cores are available; the -cpus argument was set to 4.
error UI1252: save_db is disabled.
error UI26: Script file '../save_design.sh' execution failed (and stopped) at line 1 (write_db -file db/final.db).
info UI155: Nitro-SoC terminated with exit status of 3 (abort).
#---------------------------------------------------------------------
# end session at Sun Dec 4 17:43:59 2022
#---------------------------------------------------------------------
#---------------------------------------------------------------------
# start session at Sun Dec 4 17:44:11 2022
# Exec path is /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/arch/linux/x86_64/2.12/64/bin
#---------------------------------------------------------------------
--------------------------------------------------------------------------------
|    Nitro-SoC version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019    | 
| Running on localhost.localdomain 1core 3.9GBytes 2.6GHz 64bits mode pid 8340 | 
|             Copyright (c) 2003-2019 Mentor Graphics Corporation              | 
|                             All Rights Reserved                              | 
|         THIS WORK CONTAINS TRADE SECRET AND PROPRIETARY INFORMATION          | 
|             WHICH IS THE PROPERTY OF MENTOR GRAPHICS CORPORATION             | 
|              OR ITS LICENSORS AND IS SUBJECT TO LICENSE TERMS.               | 
--------------------------------------------------------------------------------

Nitro-SoC> start 
Nitro-SoC> read_db -file /home/vlsi/Desktop/Lab5_2022/work/db/final.db -cpus 4
warning UI4: Only 1 cores are available; the -cpus argument was set to 1.
info UI1340: Loading folded database from '/home/vlsi/Desktop/Lab5_2022/work/db/final.db'.
Database information: 
----------------------------------------------------------------------------------
| Property Name | Property Value                                 | Property Type | 
|---------------+------------------------------------------------+---------------|
| name*         |                                                | string        | 
|---------------+------------------------------------------------+---------------|
| file          | /home/vlsi/Desktop/Lab5_2022/work/db/final.db/ | string        | 
|---------------+------------------------------------------------+---------------|
| host          | Linux (localhost.localdomain)                  | string        | 
|---------------+------------------------------------------------+---------------|
| build         | 1.68700.2.290                                  | string        | 
|---------------+------------------------------------------------+---------------|
| date          | Sun Dec 4 17:25:44 2022                        | string        | 
|---------------+------------------------------------------------+---------------|
| p_version     | 2019.1.R2                                      | string        | 
|---------------+------------------------------------------------+---------------|
| comment*      |                                                | string        | 
|---------------+------------------------------------------------+---------------|
| db_version    | 4.0.5                                          | string        | 
|---------------+------------------------------------------------+---------------|
| is_current    | true                                           | bool          | 
----------------------------------------------------------------------------------

info UI33: performed database load for 0 sec (CPU time: 0 sec; MEM: RSS - 166M, CVMEM - 762M, PVMEM - 784M)
info UI1340: Loading libraries from '/home/vlsi/Desktop/Lab5_2022/work/db/final.db/Technology/'.
info UI33: performed library load for 0 sec (CPU time: 0 sec; MEM: RSS - 168M, CVMEM - 772M, PVMEM - 784M)
info UI1340: Loading design from '/home/vlsi/Desktop/Lab5_2022/work/db/final.db/Design'.
info Reading Scan data
info Reading Trailing data
Successfully mapped 0 checks
info UI33: performed design load for 0 sec (CPU time: 0 sec; MEM: RSS - 179M, CVMEM - 784M, PVMEM - 874M)
info UI33: performed source of /home/vlsi/Desktop/Lab5_2022/work/db/final.db/init_db.tcl for 0 sec (CPU time: 0 sec; MEM: RSS - 179M, CVMEM - 784M, PVMEM - 874M)
#---------------------------------------------------------------------
# start session at Sun Dec 4 17:59:30 2022
# Exec path is /home/vlsi/Installation/Nitro/nitroPack-2019.1.R2a/nitro/arch/linux/x86_64/2.12/64/bin
#---------------------------------------------------------------------
--------------------------------------------------------------------------------
|    Nitro-SoC version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019    | 
| Running on localhost.localdomain 1core 3.9GBytes 2.6GHz 64bits mode pid 8995 | 
|             Copyright (c) 2003-2019 Mentor Graphics Corporation              | 
|                             All Rights Reserved                              | 
|         THIS WORK CONTAINS TRADE SECRET AND PROPRIETARY INFORMATION          | 
|             WHICH IS THE PROPERTY OF MENTOR GRAPHICS CORPORATION             | 
|              OR ITS LICENSORS AND IS SUBJECT TO LICENSE TERMS.               | 
--------------------------------------------------------------------------------


nitro.log, current date/time: Sun Dec  4 18:00:15 2022
version 2019.1.R2 1.68700.2.290 Fri Nov 29 21:06:00 PST 2019
host localhost.localdomain, pid 8995, ppid 1

Stack trace of thread 8995 'gmain_exec'

#0 (0x0737025f) (null) : _ZN3sda6common14PrintAllStacksEv line: 0
#1 (0x010a9362) (null) : _ZN15GMainSigHandler13signalHandlerEi line: 0
#2 (0x7fce441923b0) (null) : stat line: 0
#3 (0x7fce4424fbed) (null) : stat line: 0
#4 (0x7fce48f9d37c) (null) : stat line: 0
#5 (0x7fce48f9d4ac) (null) : stat line: 0
#6 (0x07c86665) (null) : _ZN20QEventDispatcherGlib13processEventsE6QFlagsIN10QEventLoop17ProcessEventsFlagEE line: 0
#7 (0x0757d906) (null) : _ZN23QGuiEventDispatcherGlib13processEventsE6QFlagsIN10QEventLoop17ProcessEventsFlagEE line: 0
#8 (0x07c6397f) (null) : _ZN10QEventLoop13processEventsE6QFlagsINS_17ProcessEventsFlagEE line: 0
#9 (0x07c63c0d) (null) : _ZN10QEventLoop4execE6QFlagsINS_17ProcessEventsFlagEE line: 0
#10 (0x07c6802b) (null) : _ZN16QCoreApplication4execEv line: 0
#11 (0x010ac995) (null) : _ZN5GMain14runApplicationEv line: 0
#12 (0x0046aecd) (null) : main line: 0
#13 (0x7fce4417e505) (null) : stat line: 0
#14 (0x0108f4a5) (null) : _start line: 0


Stack trace of thread 9003 'gmain_exec'

#0 (0x0736f4ff) SierraBFD.cpp : _ZN3sda6commonL26print_stack_signal_handlerEiP7siginfoPv line: 0
#1 (0x7fce4759f5f0) (null) : stat line: 0
#2 (0x7fce4759b9f3) (null) : stat line: 0
#3 (0x7fce448df5ac) (null) : stat line: 0
#4 (0x0736fe2d) SierraBFD.cpp : _ZN3sda6commonL21freeze_signal_handlerEiP7siginfoPv line: 0
#5 (0x7fce4759f5f0) (null) : stat line: 0
#6 (0x7fce44251953) (null) : stat line: 0
#7 (0x7fce47ce520c) (null) : stat line: 0
#8 (0x7fce47597e65) (null) : stat line: 0
#9 (0x7fce4425a88d) (null) : stat line: 0


Stack trace of thread 9044 'TermCmdLine'

#0 (0x0736f4ff) SierraBFD.cpp : _ZN3sda6commonL26print_stack_signal_handlerEiP7siginfoPv line: 0
#1 (0x7fce4759f5f0) (null) : stat line: 0
#2 (0x7fce4759b9f3) (null) : stat line: 0
#3 (0x7fce448df5ac) (null) : stat line: 0
#4 (0x0736fe2d) SierraBFD.cpp : _ZN3sda6commonL21freeze_signal_handlerEiP7siginfoPv line: 0
#5 (0x7fce4759f5f0) (null) : stat line: 0
#6 (0x7fce4759bda2) (null) : stat line: 0
#7 (0x07b92bfa) qthread_unix.cpp : _ZL12thread_sleepP8timespec line: 0
#8 (0x07b9312d) (null) : _ZN7QThread6msleepEm line: 0
#9 (0x0112200e) (null) : _ZN20GMainTerminalCmdLine10event_hookEv line: 0
#10 (0x7fce477c8f81) (null) : stat line: 0
#11 (0x7fce477bc327) (null) : stat line: 0
#12 (0x7fce477bc47c) (null) : stat line: 0
#13 (0x7fce477b7d63) (null) : stat line: 0
#14 (0x7fce477c97b0) (null) : stat line: 0
#15 (0x011234fc) (null) : _ZN20GMainTerminalCmdLine15commandLineLoopEv line: 0
#16 (0x01124254) (null) : _ZN20GMainTerminalCmdLine3runEv line: 0
#17 (0x07b93a45) (null) : _ZN14QThreadPrivate5startEPv line: 0
#18 (0x7fce47597e65) (null) : stat line: 0
#19 (0x7fce4425a88d) (null) : stat line: 0

error UI158: Can't read or write to the terminal.
info UI155: Nitro-SoC terminated with exit status of 2 (fatal).
#---------------------------------------------------------------------
# end session at Sun Dec 4 18:00:17 2022
#---------------------------------------------------------------------
